SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32SPIN0280/MM32SPIN0280_Bootloader/Device/MM32SPIN0280/Include/reg_adc.h
////////////////////////////////////////////////////////////////////////////////
/// @file     reg_adc.h
/// @author   AE TEAM
/// @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE SERIES OF
///           MM32 FIRMWARE LIBRARY.
////////////////////////////////////////////////////////////////////////////////
/// @attention
///
/// THE EXISTING FIRMWARE IS ONLY FOR REFERENCE, WHICH IS DESIGNED TO PROVIDE
/// CUSTOMERS WITH CODING INFORMATION ABOUT THEIR PRODUCTS SO THEY CAN SAVE
/// TIME. THEREFORE, MINDMOTION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
/// CONSEQUENTIAL DAMAGES ABOUT ANY CLAIMS ARISING OUT OF THE CONTENT OF SUCH
/// HARDWARE AND/OR THE USE OF THE CODING INFORMATION CONTAINED HEREIN IN
/// CONNECTION WITH PRODUCTS MADE BY CUSTOMERS.
///
/// <H2><CENTER>&COPY; COPYRIGHT MINDMOTION </CENTER></H2>
////////////////////////////////////////////////////////////////////////////////

// Define to prevent recursive inclusion

#ifndef __REG_ADC_H
#define __REG_ADC_H

// Files includes

#include <stdint.h>
#include <stdbool.h>
#include "types.h"

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__CC_ARM)
#pragma anon_unions
#elif defined(__ICCARM__)
#pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined(__GNUC__)
// anonymous unions are enabled by default
#else
#warning Not supported compiler type
#endif

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC1_BASE                       (APB2PERIPH_BASE + 0x2400)              ///< Base Address: 0x40012400
#define ADC2_BASE                       (APB2PERIPH_BASE + 0x2800)              ///< Base Address: 0x40012800

#define ADC_VOLTAGE_REF_BASE            (0x1FFFF7E0U)                           ///< Voltage Reference base address(Half Word)
#define ADC_TEMPERATURE_BASE            (0x1FFFF7F6U)                           ///< Temperature base address(Half Word)
#define ADC_AVG_SLOPE_VALUE             (4.955)                                 ///< Temperature Avg_Slope value
// T(C) = (Vsense - V25) / Avg_Slope + 25
// V25: Vsense value for 25C
// T(C) = (Value * Vdda - offset * 3300) / (4096 * Avg_slope) + 25
// offset = (M16(ADC_TEMPERATURE_BASE)
// Vsense: current output voltage of the temperature sensor
// Vsense = Value * Vdda /4096 (Value is the converted result data of ADC)
// Avg_Slope: Average Slope for curve between Temperature vs. Vsense (given in mV/C or uV/C)
// Refer to the Temperature Sensor section for the actual values of V25 and Avg_Slope.
// Vref Fomula  (VREFoffset/4096) * 3.3V = (Value/4096)* VDDA
// VDDA = (VREFoffset/Value) * 3.3

////////////////////////////////////////////////////////////////////////////////
/// @brief Analog-to-Digital Converter register
////////////////////////////////////////////////////////////////////////////////

typedef struct {
    union {
        __IO u32 DR;                                                            ///< ADC data register,                             offset: 0x00
        __IO u32 ADDATA;
    };
    union {
        __IO u32 CFGR;                                                          ///< ADC configuration register,                    offset: 0x04
        __IO u32 ADCFG;
    };
    union {
        __IO u32 CR;                                                            ///< ADC control register,                          offset: 0x08
        __IO u32 ADCR;
    };
    union {
        __IO u32 CHSR;                                                          ///< ADC channel selection register,                offset: 0x0C
        __IO u32 ADCHS;
    };
    union {
        __IO u32 CMPR;                                                          ///< ADC window compare register,                   offset: 0x10
        __IO u32 ADCMPR;
    };
    union {
        __IO u32 SR;                                                            ///< ADC status register,                           offset: 0x14
        __IO u32 ADSTA;
    };
    union {
        __IO u32 CH0DR;                                                         ///< ADC channel0 data register,                    offset: 0x18
        __IO u32 ADDR0;
    };
    union {
        __IO u32 CH1DR;                                                         ///< ADC channel1 data register,                    offset: 0x1C
        __IO u32 ADDR1;
    };
    union {
        __IO u32 CH2DR;                                                         ///< ADC channel2 data register,                    offset: 0x20
        __IO u32 ADDR2;
    };
    union {
        __IO u32 CH3DR;                                                         ///< ADC channel3 data register,                    offset: 0x24
        __IO u32 ADDR3;
    };
    union {
        __IO u32 CH4DR;                                                         ///< ADC channel4 data register,                    offset: 0x28
        __IO u32 ADDR4;
    };
    union {
        __IO u32 CH5DR;                                                         ///< ADC channel5 data register,                    offset: 0x2C
        __IO u32 ADDR5;
    };
    union {
        __IO u32 CH6DR;                                                         ///< ADC channel6 data register,                    offset: 0x30
        __IO u32 ADDR6;
    };
    union {
        __IO u32 CH7DR;                                                         ///< ADC channel7 data register,                    offset: 0x34
        __IO u32 ADDR7;
    };
    union {
        __IO u32 CH8DR;                                                         ///< ADC channel8 data register,                    offset: 0x38
        __IO u32 ADDR8;
    };
    union {
        __IO u32 CH9DR;                                                         ///< ADC channel9 data register,                    offset: 0x3C
        __IO u32 ADDR9;
    };
    union {
        __IO u32 CH10DR;                                                        ///< ADC channel10 data register,                   offset: 0x40
        __IO u32 ADDR10;
    };
    union {
        __IO u32 CH11DR;                                                        ///< ADC channel11 data register,                   offset: 0x44
        __IO u32 ADDR11;
    };
    union {
        __IO u32 CH12DR;                                                        ///< ADC channel12 data register,                   offset: 0x48
        __IO u32 ADDR12;
    };
    union {
        __IO u32 CH13DR;                                                        ///< ADC channel13 data register,                   offset: 0x4C
        __IO u32 ADDR13;
    };
    union {
        __IO u32 CH14DR;                                                        ///< ADC channel14 data register,                   offset: 0x50
        __IO u32 ADDR14;
    };
    union {
        __IO u32 CH15DR;                                                        ///< ADC channel15 data register,                   offset: 0x54
        __IO u32 ADDR15;
    };
    __IO u32 SREXT;                                                             ///< ADC Extended Status Register,                  offset: 0x58
    __IO u32 CHANY0;                                                            ///< ADC any Chan Select Register 0,                offset: 0x5C
    __IO u32 CHANY1;                                                            ///< ADC any Chan Select Register 1,                offset: 0x60
    __IO u32 ANYCFG;                                                            ///< ADC any Chan config Register,                  offset: 0x64
    __IO u32 ANYCR;                                                             ///< ADC any Chan control Register,                 offset: 0x68
    __IO u32 ADCFG2;                                                            ///< ADC configuration register                     offset: 0x6C
    __IO u32 SMPR1;                                                             ///< Sampling configuration register 1              offset: 0x70
    __IO u32 SMPR2;                                                             ///< Sampling configuration register 2              offset: 0x74
    __IO u32 RESERVED0x78;                                                      ///< Reserved                                       offset: 0x78
    __IO u32 JOFR0;                                                             ///< Injection channel data compensation register 0 offset: 0x7C
    __IO u32 JOFR1;                                                             ///< Injection channel data compensation register 1 offset: 0x80
    __IO u32 JOFR2;                                                             ///< Injection channel data compensation register 2 offset: 0x84
    __IO u32 JOFR3;                                                             ///< Injection channel data compensation register 3 offset: 0x88
    __IO u32 JSQR;                                                              ///< Injection sequence register                    offset: 0x8C
    __IO u32 JDATA;                                                             ///< Inject data register                           offset: 0x90
    __IO u32 CORRS;                                                             ///< ADC single-ended correction parameter register offset: 0x94
    __IO u32 CORRD;                                                             ///< ADC differential correction register           offset: 0x98
    __IO u32 CORRP;                                                             ///< ADC pseudo-differential parameter register     offset: 0x9C
    __IO u32 RESERVED0xA0;                                                      ///< Reserved                                       offset: 0xA0
    __IO u32 RESERVED0xA4;                                                      ///< Reserved                                       offset: 0xA4
    __IO u32 RESERVED0xA8;                                                      ///< Reserved                                       offset: 0xA8
    __IO u32 RESERVED0xAC;                                                      ///< Reserved                                       offset: 0xAC
    __IO u32 JDR0;                                                              ///< Injection channel data register 0              offset: 0xB0
    __IO u32 JDR1;                                                              ///< Injection channel data register 1              offset: 0xB4
    __IO u32 JDR2;                                                              ///< Injection channel data register 2              offset: 0xB8
    __IO u32 JDR3;                                                              ///< Injection channel data register 3              offset: 0xBC
} ADC_TypeDef;

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC type pointer Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC1                            ((ADC_TypeDef*) ADC1_BASE)
#define ADC2                            ((ADC_TypeDef*) ADC2_BASE)

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_DR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_DR_DATA_Pos                 (0)
#define ADC_DR_DATA                     (0xFFFFU << ADC_DR_DATA_Pos)            ///< ADC 12bit convert data

#define ADC_DR_CH_Pos                   (16)
#define ADC_DR_CH                       (0x0FU << ADC_DR_CH_Pos)                ///< CHANNELSEL[19:16] (ADC current channel convert data)
#define ADC_DR_CH0                      (0x00U << ADC_DR_CH_Pos)                ///< ADC Channel select  0
#define ADC_DR_CH1                      (0x01U << ADC_DR_CH_Pos)                ///< ADC Channel select  1
#define ADC_DR_CH2                      (0x02U << ADC_DR_CH_Pos)                ///< ADC Channel select  2
#define ADC_DR_CH3                      (0x03U << ADC_DR_CH_Pos)                ///< ADC Channel select  3
#define ADC_DR_CH4                      (0x04U << ADC_DR_CH_Pos)                ///< ADC Channel select  4
#define ADC_DR_CH5                      (0x05U << ADC_DR_CH_Pos)                ///< ADC Channel select  5
#define ADC_DR_CH6                      (0x06U << ADC_DR_CH_Pos)                ///< ADC Channel select  6
#define ADC_DR_CH7                      (0x07U << ADC_DR_CH_Pos)                ///< ADC Channel select  7
#define ADC_DR_CH8                      (0x08U << ADC_DR_CH_Pos)                ///< ADC Channel select  8
#define ADC_DR_CH9                      (0x09U << ADC_DR_CH_Pos)                ///< ADC Channel select  9
#define ADC_DR_CH10                     (0x0AU << ADC_DR_CH_Pos)                ///< ADC Channel select  10
#define ADC_DR_CH11                     (0x0BU << ADC_DR_CH_Pos)                ///< ADC Channel select  11
#define ADC_DR_CH12                     (0x0CU << ADC_DR_CH_Pos)                ///< ADC Channel select  12
#define ADC_DR_CH13                     (0x0DU << ADC_DR_CH_Pos)                ///< ADC Channel select  13
#define ADC_DR_CH14                     (0x0EU << ADC_DR_CH_Pos)                ///< ADC Channel select  14
#define ADC_DR_CH15                     (0x0FU << ADC_DR_CH_Pos)                ///< ADC Channel select  15
#define ADC_DR_TempSensor               ADC_DR_CH15                             ///< ADC Channel select  15
#define ADC_DR_VoltRef                  ADC_DR_CH14                             ///< ADC Channel select  14
//  only for SPIN0280's TempSensor Chan= 15, VoltRef Chan= 14, it is different with SPIN2x and other series

