SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32SPIN0280/MM32SPIN0280_Bootloader/Device/MM32SPIN0280/Include/reg_adc.h
#define ADC_DR_OVERRUN_Pos              (20)
#define ADC_DR_OVERRUN                  (0x01U << ADC_DR_OVERRUN_Pos)           ///< ADC data will be cover
#define ADC_DR_VALID_Pos                (21)
#define ADC_DR_VALID                    (0x01U << ADC_DR_VALID_Pos)             ///< ADC data[11:0] is valid

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CFGR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_CFGR_ADEN_Pos               (0)
#define ADC_CFGR_ADEN                   (0x01U << ADC_CFGR_ADEN_Pos)            ///< Enable ADC convert
#define ADC_CFGR_ADWEN_Pos              (1)
#define ADC_CFGR_ADWEN                  (0x01U << ADC_CFGR_ADWEN_Pos)           ///< Enable ADC window compare

#define ADC_CFGR_TSEN_Pos               (2)
#define ADC_CFGR_TSEN                   (0x01U << ADC_CFGR_TSEN_Pos)             ///< Enable ADC temperature sensor
//legacy define
#define ADC_CFGR_TEN_Pos                ADC_CFGR_TSEN_Pos
#define ADC_CFGR_TEN                    ADC_CFGR_TSEN

#define ADC_CFGR_VSEN_Pos               (3)
#define ADC_CFGR_VSEN                   (0x01U << ADC_CFGR_VSEN_Pos)            ///< Enable ADC voltage reference
//legacy define
#define ADC_CFGR_VEN_Pos                ADC_CFGR_VSEN_Pos
#define ADC_CFGR_VEN                    ADC_CFGR_VSEN

#define ADC_CFGR_PRE_Pos                (4)
#define ADC_CFGR_PREL_Pos               (14)
#define ADC_CFGR_PRE                    ((0x07U << ADC_CFGR_PRE_Pos) + (0x01U << ADC_CFGR_PREL_Pos))
#define ADC_CFGR_PRE_2                  (0x00U  << ADC_CFGR_PRE_Pos)            ///< ADC preclk 2
#define ADC_CFGR_PRE_4                  (0x01U  << ADC_CFGR_PRE_Pos)            ///< ADC preclk 4
#define ADC_CFGR_PRE_6                  (0x02U  << ADC_CFGR_PRE_Pos)            ///< ADC preclk 6
#define ADC_CFGR_PRE_8                  (0x03U  << ADC_CFGR_PRE_Pos)            ///< ADC preclk 8
#define ADC_CFGR_PRE_10                 (0x04U  << ADC_CFGR_PRE_Pos)            ///< ADC preclk 10
#define ADC_CFGR_PRE_12                 (0x05U  << ADC_CFGR_PRE_Pos)            ///< ADC preclk 12
#define ADC_CFGR_PRE_14                 (0x06U  << ADC_CFGR_PRE_Pos)            ///< ADC preclk 14
#define ADC_CFGR_PRE_16                 (0x07U  << ADC_CFGR_PRE_Pos)            ///< ADC preclk 16
#define ADC_CFGR_PRE_3                  ((0x01U << ADC_CFGR_PREL_Pos) + (0x00U << ADC_CFGR_PRE_Pos))    ///< ADC preclk 3
#define ADC_CFGR_PRE_5                  ((0x01U << ADC_CFGR_PREL_Pos) + (0x01U << ADC_CFGR_PRE_Pos))    ///< ADC preclk 5
#define ADC_CFGR_PRE_7                  ((0x01U << ADC_CFGR_PREL_Pos) + (0x02U << ADC_CFGR_PRE_Pos))    ///< ADC preclk 7
#define ADC_CFGR_PRE_9                  ((0x01U << ADC_CFGR_PREL_Pos) + (0x03U << ADC_CFGR_PRE_Pos))    ///< ADC preclk 9
#define ADC_CFGR_PRE_11                 ((0x01U << ADC_CFGR_PREL_Pos) + (0x04U << ADC_CFGR_PRE_Pos))    ///< ADC preclk 11
#define ADC_CFGR_PRE_13                 ((0x01U << ADC_CFGR_PREL_Pos) + (0x05U << ADC_CFGR_PRE_Pos))    ///< ADC preclk 13
#define ADC_CFGR_PRE_15                 ((0x01U << ADC_CFGR_PREL_Pos) + (0x06U << ADC_CFGR_PRE_Pos))    ///< ADC preclk 15
#define ADC_CFGR_PRE_17                 ((0x01U << ADC_CFGR_PREL_Pos) + (0x07U << ADC_CFGR_PRE_Pos))    ///< ADC preclk 17
#define ADC_CFGR_RSLTCTL_Pos            (7)
#define ADC_CFGR_RSLTCTL                (0x07U << ADC_CFGR_RSLTCTL_Pos)         ///< ADC resolution select
#define ADC_CFGR_RSLTCTL_12             (0x00U << ADC_CFGR_RSLTCTL_Pos)         ///< ADC resolution select 12bit or Pseudo-differential conversion data resolution select 13 bit
#define ADC_CFGR_RSLTCTL_11             (0x01U << ADC_CFGR_RSLTCTL_Pos)         ///< ADC resolution select 11bit or Pseudo-differential conversion data resolution select 12 bit
#define ADC_CFGR_RSLTCTL_10             (0x02U << ADC_CFGR_RSLTCTL_Pos)         ///< ADC resolution select 10bit or Pseudo-differential conversion data resolution select 11 bit
#define ADC_CFGR_RSLTCTL_9              (0x03U << ADC_CFGR_RSLTCTL_Pos)         ///< ADC resolution select 9bit  or Pseudo-differential conversion data resolution select 10 bit
#define ADC_CFGR_RSLTCTL_8              (0x04U << ADC_CFGR_RSLTCTL_Pos)         ///< ADC resolution select 8bit  or Pseudo-differential conversion data resolution select 9 bit

#define ADC_CFGR_RSLTCTL_PD_13          (0x00U << ADC_CFGR_RSLTCTL_Pos)         ///< Pseudo-differential conversion data resolution select 13 bit
#define ADC_CFGR_RSLTCTL_PD_12          (0x01U << ADC_CFGR_RSLTCTL_Pos)         ///< Pseudo-differential conversion data resolution select 12 bit
#define ADC_CFGR_RSLTCTL_PD_11          (0x02U << ADC_CFGR_RSLTCTL_Pos)         ///< Pseudo-differential conversion data resolution select 11 bit
#define ADC_CFGR_RSLTCTL_PD_10          (0x03U << ADC_CFGR_RSLTCTL_Pos)         ///< Pseudo-differential conversion data resolution select 10 bit
#define ADC_CFGR_RSLTCTL_PD_9           (0x04U << ADC_CFGR_RSLTCTL_Pos)         ///< Pseudo-differential conversion data resolution select 9 bit
#define ADC_CFGR_JAWDEN_Pos             (16)
#define ADC_CFGR_JAWDEN                 (0x01U << ADC_CFGR_JAWDEN_Pos)          ///< Inject ADC conversion window comparison enable
//legacy define
#define ADC_CFGR_JADWEN_Pos             ADC_CFGR_JAWDEN_Pos
#define ADC_CFGR_JADWEN                 ADC_CFGR_JAWDEN

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_CR_EOSIE_Pos                (0)
#define ADC_CR_EOSIE                    (0x01U << ADC_CR_EOSIE_Pos)             ///< ADC interrupt enable
//legacy define
#define ADC_CR_ADIE_Pos                 ADC_CR_EOSIE_Pos
#define ADC_CR_ADIE                     ADC_CR_EOSIE

#define ADC_CR_AWDIE_Pos                (1)
#define ADC_CR_AWDIE                    (0x01U << ADC_CR_AWDIE_Pos)             ///< Interrupt Enable of Analog Watchdog
//legacy define
#define ADC_CR_ADWIE_Pos                ADC_CR_AWDIE_Pos
#define ADC_CR_ADWIE                    ADC_CR_AWDIE

#define ADC_CR_TRGEN_Pos                (2)
#define ADC_CR_TRGEN                    (0x01U << ADC_CR_TRGEN_Pos)             ///< extranal trigger single start AD convert
#define ADC_CR_DMAEN_Pos                (3)
#define ADC_CR_DMAEN                    (0x01U << ADC_CR_DMAEN_Pos)             ///< ADC DMA enable

#define ADC_CR_ADST_Pos                 (8)
#define ADC_CR_ADST                     (0x01U << ADC_CR_ADST_Pos)              ///< ADC start convert data
#define ADC_CR_MD_Pos                   (9)
#define ADC_CR_MD                       (0x03U << ADC_CR_MD_Pos)                ///< ADC convert mode
//legacy define
#define ADC_CR_MODE_Pos                 ADC_CR_MD_Pos
#define ADC_CR_MODE                     ADC_CR_MD
#define ADC_CR_IMM                      (0x00U << ADC_CR_MODE_Pos)              ///< ADC imm convert mode
#define ADC_CR_SCAN                     (0x01U << ADC_CR_MODE_Pos)              ///< ADC scan convert mode
#define ADC_CR_CONTINUE                 (0x02U << ADC_CR_MODE_Pos)              ///< ADC continue scan convert mode
#define ADC_CR_ALIGN_Pos                (11)
#define ADC_CR_ALIGN                    (0x01U << ADC_CR_ALIGN_Pos)             ///< ADC data align
#define ADC_CR_LEFT                     (0x01U << ADC_CR_ALIGN_Pos)             ///< ADC data left align
#define ADC_CR_RIGHT                    (0x00U << ADC_CR_ALIGN_Pos)             ///< ADC data right align
#define ADC_CR_CMPCH_Pos                (12)
#define ADC_CR_CMPCH                    (0x0FU << ADC_CR_CMPCH_Pos)             ///< CMPCH[15:12] ADC window compare channel0 convert data
#define ADC_CR_CMPCH_0                  (0x00U << ADC_CR_CMPCH_Pos)             ///< Select Compare Channel 0 Conversion Results
#define ADC_CR_CMPCH_1                  (0x01U << ADC_CR_CMPCH_Pos)             ///< Select Compare Channel 1 Conversion Results
#define ADC_CR_CMPCH_2                  (0x02U << ADC_CR_CMPCH_Pos)             ///< Select Compare Channel 2 Conversion Results
#define ADC_CR_CMPCH_3                  (0x03U << ADC_CR_CMPCH_Pos)             ///< Select Compare Channel 3 Conversion Results
#define ADC_CR_CMPCH_4                  (0x04U << ADC_CR_CMPCH_Pos)             ///< Select Compare Channel 4 Conversion Results
#define ADC_CR_CMPCH_5                  (0x05U << ADC_CR_CMPCH_Pos)             ///< Select Compare Channel 5 Conversion Results
#define ADC_CR_CMPCH_6                  (0x06U << ADC_CR_CMPCH_Pos)             ///< Select Compare Channel 6 Conversion Results
#define ADC_CR_CMPCH_7                  (0x07U << ADC_CR_CMPCH_Pos)             ///< Select Compare Channel 7 Conversion Results
#define ADC_CR_CMPCH_8                  (0x08U << ADC_CR_CMPCH_Pos)             ///< Select Compare Channel 8 Conversion Results
#define ADC_CR_CMPCH_9                  (0x09U << ADC_CR_CMPCH_Pos)             ///< Select Compare Channel 9 Conversion Results
#define ADC_CR_CMPCH_10                 (0x0AU << ADC_CR_CMPCH_Pos)             ///< Select Compare Channel 10 Conversion Results
#define ADC_CR_CMPCH_11                 (0x0BU << ADC_CR_CMPCH_Pos)             ///< Select Compare Channel 11 Conversion Results
#define ADC_CR_CMPCH_12                 (0x0CU << ADC_CR_CMPCH_Pos)             ///< Select Compare Channel 12 Conversion Results
#define ADC_CR_CMPCH_13                 (0x0DU << ADC_CR_CMPCH_Pos)             ///< Select Compare Channel 13 Conversion Results
#define ADC_CR_CMPCH_14                 (0x0FU << ADC_CR_CMPCH_Pos)             ///< Select Compare Channel 14 Conversion Results
#define ADC_CR_CMPCH_ALL                (0x0EU << ADC_CR_CMPCH_Pos)             ///< Select Compare ALL Channel Conversion Results
//  only for SPIN0280's TempSensor Chan= 15, VoltRef Chan= 14, it is different with SPIN2x and other series

#define ADC_CR_SCANDIR_Pos              (16)
#define ADC_CR_SCANDIR                  (0x01U << ADC_CR_SCANDIR_Pos)           ///< ADC scan direction
#define ADC_CR_TRGSEL_H_Pos             (17)
#define ADC_CR_TRGSEL_L_Pos             (4)
#define ADC_CR_TRGSEL                   ((0x03U << ADC_CR_TRGSEL_H_Pos) + (0x07U << ADC_CR_TRGSEL_L_Pos))   ///< TRGSEL[6:4][18:17] ADC external trigger source select
#define ADC_CR_T1_CC1                   (0x00U << ADC_CR_TRGSEL_L_Pos)          ///< The external trigger source of the ADC is T1_CC1
#define ADC_CR_T1_CC2                   (0x01U << ADC_CR_TRGSEL_L_Pos)          ///< The external trigger source of the ADC is T1_CC2
#define ADC_CR_T1_CC3                   (0x02U << ADC_CR_TRGSEL_L_Pos)          ///< The external trigger source of the ADC is T1_CC3
#define ADC_CR_T2_CC2                   (0x03U << ADC_CR_TRGSEL_L_Pos)          ///< The external trigger source of the ADC is T2_CC2
#define ADC_CR_T3_TRIG                  (0x04U << ADC_CR_TRGSEL_L_Pos)          ///< The external trigger source of the ADC is T3_TRIG
#define ADC_CR_T1_CC4_CC5               (0x05U << ADC_CR_TRGSEL_L_Pos)          ///< The external trigger source of the ADC is TIM1_CC4 or TIM1_CC5
#define ADC_CR_T3_CC1                   (0x06U << ADC_CR_TRGSEL_L_Pos)          ///< The external trigger source of the ADC is T3_CC1
#define ADC_CR_EXTI_11                  (0x07U << ADC_CR_TRGSEL_L_Pos)          ///< The external trigger source of the ADC is EXTI_11
#define ADC_CR_T1_TRIG                  ((0x01U << ADC_CR_TRGSEL_H_Pos) + (0x00U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is T1_TRIG
#define ADC_CR_T8_CC4                   ((0x01U << ADC_CR_TRGSEL_H_Pos) + (0x01U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is T8_CC4
#define ADC_CR_T8_CC4_CC5               ((0x01U << ADC_CR_TRGSEL_H_Pos) + (0x02U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is T8_CC4_CC5
#define ADC_CR_T2_CC1                   ((0x01U << ADC_CR_TRGSEL_H_Pos) + (0x03U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is T2_CC1
#define ADC_CR_T3_CC4                   ((0x01U << ADC_CR_TRGSEL_H_Pos) + (0x04U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is T3_CC4
#define ADC_CR_T2_TRIG                  ((0x01U << ADC_CR_TRGSEL_H_Pos) + (0x05U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is T2_TRIG
#define ADC_CR_T8_CC5                   ((0x01U << ADC_CR_TRGSEL_H_Pos) + (0x06U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is T8_CC5
#define ADC_CR_EXTI_15                  ((0x01U << ADC_CR_TRGSEL_H_Pos) + (0x07U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is EXTI_15
#define ADC_CR_T1_CC4                   ((0x02U << ADC_CR_TRGSEL_H_Pos) + (0x00U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is T1_CC4
#define ADC_CR_T1_CC5                   ((0x02U << ADC_CR_TRGSEL_H_Pos) + (0x01U << ADC_CR_TRGSEL_L_Pos))   ///< The external trigger source of the ADC is T1_CC5

#define ADC_CR_TRGSHIFT_Pos             (19)
#define ADC_CR_TRGSHIFT                 (0x07U << ADC_CR_TRGSHIFT_Pos)          ///< External trigger shift sample
#define ADC_CR_TRGSHIFT_0               (0x00U << ADC_CR_TRGSHIFT_Pos)          ///< No shift
#define ADC_CR_TRGSHIFT_4               (0x01U << ADC_CR_TRGSHIFT_Pos)          ///< Shift 4 period
#define ADC_CR_TRGSHIFT_16              (0x02U << ADC_CR_TRGSHIFT_Pos)          ///< Shift 16 period
#define ADC_CR_TRGSHIFT_32              (0x03U << ADC_CR_TRGSHIFT_Pos)          ///< Shift 32 period
#define ADC_CR_TRGSHIFT_64              (0x04U << ADC_CR_TRGSHIFT_Pos)          ///< Shift 64 period
#define ADC_CR_TRGSHIFT_128             (0x05U << ADC_CR_TRGSHIFT_Pos)          ///< Shift 128 period
#define ADC_CR_TRGSHIFT_256             (0x06U << ADC_CR_TRGSHIFT_Pos)          ///< Shift 256 period
#define ADC_CR_TRGSHIFT_512             (0x07U << ADC_CR_TRGSHIFT_Pos)          ///< Shift 512 period
#define ADC_CR_CALIBEN_Pos              (22)
#define ADC_CR_CALIBEN                  (0x01U << ADC_CR_CALIBEN_Pos)           ///< Self-calibration enable
#define ADC_CR_CALIBSEL_Pos             (23)
#define ADC_CR_CALIBSEL                 (0x01U << ADC_CR_CALIBSEL_Pos)          ///< Self-calibration voltage selection
#define ADC_CR_TRG_EDGE_Pos             (24)
#define ADC_CR_TRG_EDGE                 (0x03U << ADC_CR_TRG_EDGE_Pos)          ///< ADC trig edge config
#define ADC_CR_TRG_EDGE_DUAL            (0x00U << ADC_CR_TRG_EDGE_Pos)          ///< ADC dual edge trig mode
#define ADC_CR_TRG_EDGE_DOWN            (0x01U << ADC_CR_TRG_EDGE_Pos)          ///< ADC down edge trig mode
#define ADC_CR_TRG_EDGE_UP              (0x02U << ADC_CR_TRG_EDGE_Pos)          ///< ADC up   edge trig mode
#define ADC_CR_TRG_EDGE_MASK            (0x03U << ADC_CR_TRG_EDGE_Pos)          ///< ADC mask edge trig mode

#define ADC_CR_EOSMPIE_Pos              (26)
#define ADC_CR_EOSMPIE                  (0X01U << ADC_CR_EOSMPIE_Pos)           ///< ADC end sampling flag interrupt enable
#define ADC_CR_EOCIE_Pos                (27)
#define ADC_CR_EOCIE                    (0X01U << ADC_CR_EOCIE_Pos)             ///< ADC end of conversion interrupt enable

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CHSR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_CHSR_CH0_Pos                (0)
#define ADC_CHSR_CH0                    (0x01U << ADC_CHSR_CH0_Pos)             ///< Enable ADC channel 0
#define ADC_CHSR_CH1_Pos                (1)
#define ADC_CHSR_CH1                    (0x01U << ADC_CHSR_CH1_Pos)             ///< Enable ADC channel 1
#define ADC_CHSR_CH2_Pos                (2)
#define ADC_CHSR_CH2                    (0x01U << ADC_CHSR_CH2_Pos)             ///< Enable ADC channel 2
#define ADC_CHSR_CH3_Pos                (3)
#define ADC_CHSR_CH3                    (0x01U << ADC_CHSR_CH3_Pos)             ///< Enable ADC channel 3
#define ADC_CHSR_CH4_Pos                (4)
#define ADC_CHSR_CH4                    (0x01U << ADC_CHSR_CH4_Pos)             ///< Enable ADC channel 4
#define ADC_CHSR_CH5_Pos                (5)
#define ADC_CHSR_CH5                    (0x01U << ADC_CHSR_CH5_Pos)             ///< Enable ADC channel 5
#define ADC_CHSR_CH6_Pos                (6)
#define ADC_CHSR_CH6                    (0x01U << ADC_CHSR_CH6_Pos)             ///< Enable ADC channel 6
#define ADC_CHSR_CH7_Pos                (7)
#define ADC_CHSR_CH7                    (0x01U << ADC_CHSR_CH7_Pos)             ///< Enable ADC channel 7
#define ADC_CHSR_CH8_Pos                (8)
#define ADC_CHSR_CH8                    (0x01U << ADC_CHSR_CH8_Pos)             ///< Enable ADC channel 8
#define ADC_CHSR_CH9_Pos                (9)
#define ADC_CHSR_CH9                    (0x01U << ADC_CHSR_CH9_Pos)             ///< Enable ADC channel 9
#define ADC_CHSR_CH10_Pos               (10)
#define ADC_CHSR_CH10                   (0x01U << ADC_CHSR_CH10_Pos)            ///< Enable ADC channel 10
#define ADC_CHSR_CH11_Pos               (11)
#define ADC_CHSR_CH11                   (0x01U << ADC_CHSR_CH11_Pos)            ///< Enable ADC channel 11
#define ADC_CHSR_CH12_Pos               (12)
#define ADC_CHSR_CH12                   (0x01U << ADC_CHSR_CH12_Pos)            ///< Enable ADC channel 12
#define ADC_CHSR_CH13_Pos               (13)
#define ADC_CHSR_CH13                   (0x01U << ADC_CHSR_CH13_Pos)            ///< Enable ADC channel 13
#define ADC_CHSR_CH14_Pos               (14)
#define ADC_CHSR_CH14                   (0x01U << ADC_CHSR_CH14_Pos)            ///< Enable ADC channel 14
#define ADC_CHSR_CH15_Pos               (15)
#define ADC_CHSR_CH15                   (0x01U << ADC_CHSR_CH15_Pos)            ///< Enable ADC channel 15
#define ADC_CHSR_CHT_Pos                ADC_CHSR_CH15_Pos
#define ADC_CHSR_CHT                    ADC_CHSR_CH15                           ///< Enable Temperature Sensor
#define ADC_CHSR_CHV_Pos                ADC_CHSR_CH14_Pos
#define ADC_CHSR_CHV                    ADC_CHSR_CH14                           ///< Enable Voltage Sensor
//  only for SPIN0280's TempSensor Chan= 15, VoltRef Chan= 14, it is different with SPIN2x and other series
////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CMPR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_CMPR_CMPLDATA_Pos           (0)
#define ADC_CMPR_CMPLDATA               (0x0FFFU << ADC_CMPR_CMPLDATA_Pos)      ///< ADC 12bit window compare DOWN LEVEL DATA
#define ADC_CMPR_CMPHDATA_Pos           (16)
#define ADC_CMPR_CMPHDATA               (0x0FFFU << ADC_CMPR_CMPHDATA_Pos)      ///< ADC 12bit window compare UP LEVEL DATA

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_SR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_SR_EOSIF_Pos                (0)
#define ADC_SR_EOSIF                    (0x01U << ADC_SR_EOSIF_Pos)             ///< ADC convert complete flag
//legacy define
#define ADC_SR_ADIF_Pos                 ADC_SR_EOSIF_Pos
#define ADC_SR_ADIF                     ADC_SR_EOSIF

#define ADC_SR_AWDIF_Pos                (1)
#define ADC_SR_AWDIF                    (0x01U << ADC_SR_AWDIF_Pos)             ///< ADC compare flag
//legacy define
#define ADC_SR_ADWIF_Pos                ADC_SR_AWDIF_Pos
#define ADC_SR_ADWIF                    ADC_SR_AWDIF

#define ADC_SR_BUSY_Pos                 (2)
#define ADC_SR_BUSY                     (0x01U << ADC_SR_BUSY_Pos)              ///< ADC busy flag
#define ADC_SR_CH_Pos                   (4)
#define ADC_SR_CH                       (0x0FU << ADC_SR_CH_Pos)                ///< CHANNEL[7:4] ADC current channel
#define ADC_SR_CH0                      (0x00U << ADC_SR_CH_Pos)                ///< Channel 0 is the current conversion channel
#define ADC_SR_CH1                      (0x01U << ADC_SR_CH_Pos)                ///< Channel 1 is the current conversion channel
#define ADC_SR_CH2                      (0x02U << ADC_SR_CH_Pos)                ///< Channel 2 is the current conversion channel
#define ADC_SR_CH3                      (0x03U << ADC_SR_CH_Pos)                ///< Channel 3 is the current conversion channel
#define ADC_SR_CH4                      (0x04U << ADC_SR_CH_Pos)                ///< Channel 4 is the current conversion channel
#define ADC_SR_CH5                      (0x05U << ADC_SR_CH_Pos)                ///< Channel 5 is the current conversion channel
#define ADC_SR_CH6                      (0x06U << ADC_SR_CH_Pos)                ///< Channel 6 is the current conversion channel
#define ADC_SR_CH7                      (0x07U << ADC_SR_CH_Pos)                ///< Channel 7 is the current conversion channel
#define ADC_SR_CH8                      (0x08U << ADC_SR_CH_Pos)                ///< Channel 8 is the current conversion channel
#define ADC_SR_CH9                      (0x09U << ADC_SR_CH_Pos)                ///< Channel 9 is the current conversion channel
#define ADC_SR_CH10                     (0x0AU << ADC_SR_CH_Pos)                ///< Channel 10 is the current conversion channel
#define ADC_SR_CH11                     (0x0BU << ADC_SR_CH_Pos)                ///< Channel 11 is the current conversion channel
#define ADC_SR_CH12                     (0x0CU << ADC_SR_CH_Pos)                ///< Channel 12 is the current conversion channel
#define ADC_SR_CH13                     (0x0DU << ADC_SR_CH_Pos)                ///< Channel 13 is the current conversion channel
#define ADC_SR_CH14                     (0x0EU << ADC_SR_CH_Pos)                ///< Channel 14 is the current conversion channel
#define ADC_SR_CH15                     (0x0FU << ADC_SR_CH_Pos)                ///< Channel 15 is the current conversion channel
#define ADC_SR_CHT                      ADC_SR_CH15                             ///< Channel 15 is the current conversion channel
#define ADC_SR_CHV                      ADC_SR_CH14                             ///< Channel 14 is the current conversion channel
//  only for SPIN0280's TempSensor Chan= 15, VoltRef Chan= 14, it is different with SPIN2x and other series
#define ADC_SR_VALID_Pos                (8)
#define ADC_SR_VALID                    (0x0FFFU << ADC_SR_VALID_Pos)           ///< VALID[19:8] ADC channel 0..11 valid flag
#define ADC_SR_OVERRUN_Pos              (20)
#define ADC_SR_OVERRUN                  (0x0FFFU << ADC_SR_OVERRUN_Pos)         ///< OVERRUN[31:20] ADC channel 0..11 data covered flag

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CHnDR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_CHDR_DATA_Pos               (0)
#define ADC_CHDR_DATA                   (0xFFFFU << ADC_CHDR_DATA_Pos)          ///< ADC channel convert data
#define ADC_CHDR_OVERRUN_Pos            (20)
#define ADC_CHDR_OVERRUN                (0x01U << ADC_CHDR_OVERRUN_Pos)         ///< ADC data covered flag
#define ADC_CHDR_VALID_Pos              (21)
#define ADC_CHDR_VALID                  (0x01U << ADC_CHDR_VALID_Pos)           ///< ADC data valid flag

