SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32SPIN0280/MM32SPIN0280_Bootloader/Device/MM32SPIN0280/Include/reg_adc.h
////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_SREXT Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_SREXT_VALID_Pos             (0)
#define ADC_SREXT_VALID                 (0x0FU << ADC_SREXT_VALID_Pos)          ///< VALID[3:0] ADC channel 12,14..15 valid flag
#define ADC_SREXT_VALID_CH12            (0x01U << ADC_SREXT_VALID_Pos)          ///< channel 12
#define ADC_SREXT_VALID_CH13            (0x02U << ADC_SREXT_VALID_Pos)          ///< channel 13
#define ADC_SREXT_VALID_CH14            (0x04U << ADC_SREXT_VALID_Pos)          ///< channel 14  V_SENSOR
#define ADC_SREXT_VALID_CH15            (0x08U << ADC_SREXT_VALID_Pos)          ///< channel 15  T_SENSOR
//  only for SPIN0280's TempSensor Chan= 15, VoltRef Chan= 14, it is different with SPIN2x and other series
#define ADC_SREXT_OVERRUN_Pos           (4)
#define ADC_SREXT_OVERRUN               (0x0FU << ADC_SREXT_OVERRUN_Pos)        ///< OVERRUN[7:4] ADC channel 12,14..15 data covered flag
#define ADC_SREXT_OVERRUN_CH12          (0x01U << ADC_SREXT_OVERRUN_Pos)        ///< channel 12
#define ADC_SREXT_OVERRUN_CH13          (0x02U << ADC_SREXT_OVERRUN_Pos)        ///< channel 13
#define ADC_SREXT_OVERRUN_CH14          (0x04U << ADC_SREXT_OVERRUN_Pos)        ///< channel 14  V_SENSOR
#define ADC_SREXT_OVERRUN_CH15          (0x08U << ADC_SREXT_OVERRUN_Pos)        ///< channel 15  T_SENSOR
//  only for SPIN0280's TempSensor Chan= 15, VoltRef Chan= 14, it is different with SPIN2x and other series
#define ADC_SREXT_EOSMPIF_Pos           (16)
#define ADC_SREXT_EOSMPIF               (0x01U << ADC_SREXT_EOSMPIF_Pos)        ///< End of sampling interrupt flag
#define ADC_SREXT_EOCIF_Pos             (17)
#define ADC_SREXT_EOCIF                 (0x01U << ADC_SREXT_EOCIF_Pos)          ///< End of conversion interrupt flag
#define ADC_SREXT_JEOSMPIF_Pos          (18)
#define ADC_SREXT_JEOSMPIF              (0x01U << ADC_SREXT_JEOSMPIF_Pos)       ///< Injected channel end of sampling interrupt flag
#define ADC_SREXT_JEOCIF_Pos            (19)
#define ADC_SREXT_JEOCIF                (0x01U << ADC_SREXT_JEOCIF_Pos)         ///< Injected channel end of conversion interrupt flag
#define ADC_SREXT_JEOSIF_Pos            (20)
#define ADC_SREXT_JEOSIF                (0x01U << ADC_SREXT_JEOSIF_Pos)         ///< Injected channel end of sequential conversion interrupt flag
#define ADC_SREXT_JBUSY_Pos             (21)
#define ADC_SREXT_JBUSY                 (0x01U << ADC_SREXT_JBUSY_Pos)          ///< Injection mode busy/idle
#define ADC_SREXT_EOCALIF_Pos           (24)
#define ADC_SREXT_EOCALIF               (0x01U << ADC_SREXT_EOCALIF_Pos)        ///< End of calibration interrupt flag
#define ADC_SREXT_CALBUSY_Pos           (25)
#define ADC_SREXT_CALBUSY               (0x01U << ADC_SREXT_CALBUSY_Pos)        ///< calibration Busy
#define ADC_SREXT_FREOCIF_Pos           (26)
#define ADC_SREXT_FREOCIF               (0x01U << ADC_SREXT_FREOCIF_Pos)        ///< The calibration factor is read to the end of the data register

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CHANY0 select Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_CHANY0_SEL0_Pos             (0)                                     ///< CHANY_SEL0 (Bit 0)
#define ADC_CHANY0_SEL0                 (0x0FU << ADC_CHANY0_SEL0_Pos)          ///< CHANY_SEL0 (Bitfield-Mask: 0x0f)
#define ADC_CHANY0_SEL1_Pos             (4)                                     ///< CHANY_SEL1 (Bit 4)
#define ADC_CHANY0_SEL1                 (0x0FU << ADC_CHANY0_SEL1_Pos)          ///< CHANY_SEL1 (Bitfield-Mask: 0x0f)
#define ADC_CHANY0_SEL2_Pos             (8)                                     ///< CHANY_SEL2 (Bit 8)
#define ADC_CHANY0_SEL2                 (0x0FU << ADC_CHANY0_SEL2_Pos)          ///< CHANY_SEL2 (Bitfield-Mask: 0x0f)
#define ADC_CHANY0_SEL3_Pos             (12)                                    ///< CHANY_SEL3 (Bit 12)
#define ADC_CHANY0_SEL3                 (0x0FU << ADC_CHANY0_SEL3_Pos)          ///< CHANY_SEL3 (Bitfield-Mask: 0x0f)
#define ADC_CHANY0_SEL4_Pos             (16)                                    ///< CHANY_SEL4 (Bit 16)
#define ADC_CHANY0_SEL4                 (0x0FU << ADC_CHANY0_SEL4_Pos)          ///< CHANY_SEL4 (Bitfield-Mask: 0x0f)
#define ADC_CHANY0_SEL5_Pos             (20)                                    ///< CHANY_SEL5 (Bit 20)
#define ADC_CHANY0_SEL5                 (0x0FU << ADC_CHANY0_SEL5_Pos)          ///< CHANY_SEL5 (Bitfield-Mask: 0x0f)
#define ADC_CHANY0_SEL6_Pos             (24)                                    ///< CHANY_SEL6 (Bit 24)
#define ADC_CHANY0_SEL6                 (0x0FU << ADC_CHANY0_SEL6_Pos)          ///< CHANY_SEL6 (Bitfield-Mask: 0x0f)
#define ADC_CHANY0_SEL7_Pos             (28)                                    ///< CHANY_SEL7 (Bit 28)
#define ADC_CHANY0_SEL7                 (0x0FU << ADC_CHANY0_SEL7_Pos)          ///< CHANY_SEL7 (Bitfield-Mask: 0x0f)

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CHANY1 select Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_CHANY1_SEL8_Pos             (0)                                     ///< CHANY_SEL8 (Bit 0)
#define ADC_CHANY1_SEL8                 (0x0FU << ADC_CHANY1_SEL8_Pos)          ///< CHANY_SEL8 (Bitfield-Mask: 0x0f)
#define ADC_CHANY1_SEL9_Pos             (4)                                     ///< CHANY_SEL9 (Bit 4)
#define ADC_CHANY1_SEL9                 (0x0FU << ADC_CHANY1_SEL9_Pos)          ///< CHANY_SEL9 (Bitfield-Mask: 0x0f)
#define ADC_CHANY1_SEL10_Pos            (8)                                     ///< CHANY_SEL10 (Bit 8)
#define ADC_CHANY1_SEL10                (0x0FU << ADC_CHANY1_SEL10_Pos)         ///< CHANY_SEL10 (Bitfield-Mask: 0x0f)
#define ADC_CHANY1_SEL11_Pos            (12)                                    ///< CHANY_SEL11 (Bit 12)
#define ADC_CHANY1_SEL11                (0x0FU << ADC_CHANY1_SEL11_Pos)         ///< CHANY_SEL11 (Bitfield-Mask: 0x0f)
#define ADC_CHANY1_SEL12_Pos            (16)                                    ///< CHANY_SEL12 (Bit 16)
#define ADC_CHANY1_SEL12                (0x0FU << ADC_CHANY1_SEL12_Pos)         ///< CHANY_SEL12 (Bitfield-Mask: 0x0f)
#define ADC_CHANY1_SEL13_Pos            (20)                                    ///< CHANY_SEL13 (Bit 20)
#define ADC_CHANY1_SEL13                (0x0FU << ADC_CHANY1_SEL13_Pos)         ///< CHANY_SEL13 (Bitfield-Mask: 0x0f)
#define ADC_CHANY1_SEL14_Pos            (24)                                    ///< CHANY_SEL14 (Bit 24)
#define ADC_CHANY1_SEL14                (0x0FU << ADC_CHANY1_SEL14_Pos)         ///< CHANY_SEL14 (Bitfield-Mask: 0x0f)
#define ADC_CHANY1_SEL15_Pos            (28)                                    ///< CHANY_SEL15 (Bit 28)
#define ADC_CHANY1_SEL15                (0x0FU << ADC_CHANY1_SEL15_Pos)         ///< CHANY_SEL15 (Bitfield-Mask: 0x0f)

