SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32SPIN0280/MM32SPIN0280_Bootloader/Device/MM32SPIN0280/Include/reg_adc.h
#define ADC1_CHANY0_SEL0_Pos            ADC_CHANY0_SEL0_Pos                     ///< CHANY_SEL0 (Bit 0)
#define ADC1_CHANY0_SEL0                ADC_CHANY0_SEL0                         ///< CHANY_SEL0 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY0_SEL1_Pos            ADC_CHANY0_SEL1_Pos                     ///< CHANY_SEL1 (Bit 4)
#define ADC1_CHANY0_SEL1                ADC_CHANY0_SEL1                         ///< CHANY_SEL1 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY0_SEL2_Pos            ADC_CHANY0_SEL2_Pos                     ///< CHANY_SEL2 (Bit 8)
#define ADC1_CHANY0_SEL2                ADC_CHANY0_SEL2                         ///< CHANY_SEL2 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY0_SEL3_Pos            ADC_CHANY0_SEL3_Pos                     ///< CHANY_SEL3 (Bit 12)
#define ADC1_CHANY0_SEL3                ADC_CHANY0_SEL3                         ///< CHANY_SEL3 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY0_SEL4_Pos            ADC_CHANY0_SEL4_Pos                     ///< CHANY_SEL4 (Bit 16)
#define ADC1_CHANY0_SEL4                ADC_CHANY0_SEL4                         ///< CHANY_SEL4 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY0_SEL5_Pos            ADC_CHANY0_SEL5_Pos                     ///< CHANY_SEL5 (Bit 20)
#define ADC1_CHANY0_SEL5                ADC_CHANY0_SEL5                         ///< CHANY_SEL5 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY0_SEL6_Pos            ADC_CHANY0_SEL6_Pos                     ///< CHANY_SEL6 (Bit 24)
#define ADC1_CHANY0_SEL6                ADC_CHANY0_SEL6                         ///< CHANY_SEL6 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY0_SEL7_Pos            ADC_CHANY0_SEL7_Pos                     ///< CHANY_SEL7 (Bit 28)
#define ADC1_CHANY0_SEL7                ADC_CHANY0_SEL7                         ///< CHANY_SEL7 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY1_SEL8_Pos            ADC_CHANY1_SEL8_Pos                     ///< CHANY_SEL8 (Bit 0)
#define ADC1_CHANY1_SEL8                ADC_CHANY1_SEL8                         ///< CHANY_SEL8 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY1_SEL9_Pos            ADC_CHANY1_SEL9_Pos                     ///< CHANY_SEL9 (Bit 4)
#define ADC1_CHANY1_SEL9                ADC_CHANY1_SEL9                         ///< CHANY_SEL9 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY1_SEL10_Pos           ADC_CHANY1_SEL10_Pos                    ///< CHANY_SEL10 (Bit 8)
#define ADC1_CHANY1_SEL10               ADC_CHANY1_SEL10                        ///< CHANY_SEL10 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY1_SEL11_Pos           ADC_CHANY1_SEL11_Pos                    ///< CHANY_SEL11 (Bit 12)
#define ADC1_CHANY1_SEL11               ADC_CHANY1_SEL11                        ///< CHANY_SEL11 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY1_SEL12_Pos           ADC_CHANY1_SEL12_Pos                    ///< CHANY_SEL12 (Bit 16)
#define ADC1_CHANY1_SEL12               ADC_CHANY1_SEL12                        ///< CHANY_SEL12 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY1_SEL13_Pos           ADC_CHANY1_SEL13_Pos                    ///< CHANY_SEL13 (Bit 20)
#define ADC1_CHANY1_SEL13               ADC_CHANY1_SEL13                        ///< CHANY_SEL13 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY1_SEL14_Pos           ADC_CHANY1_SEL14_Pos                    ///< CHANY_SEL14 (Bit 24)
#define ADC1_CHANY1_SEL14               ADC_CHANY1_SEL14                        ///< CHANY_SEL14 (Bitfield-Mask: 0x0f)
#define ADC1_CHANY1_SEL15_Pos           ADC_CHANY1_SEL15_Pos                    ///< CHANY_SEL15 (Bit 28)
#define ADC1_CHANY1_SEL15               ADC_CHANY1_SEL15                        ///< CHANY_SEL15 (Bitfield-Mask: 0x0f)

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CHANY config number Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_CHANY_CFG_NUM_Max           (16)                                    ///< CHANY_CFG_NUM Max Value is 16
#define ADC1_CHANY_CFG_NUM_Max          ADC_CHANY_CFG_NUM_Max
#define ADC_CHANY_CFG_NUM_Pos           (0)                                     ///< CHANY_CFG_NUM Pos
#define ADC_CHANY_CFG_NUM               (0x0FU << ADC_CHANY_CFG_NUM_Pos)        ///< CHANY_CFG_NUM (Bitfield-Mask: 0x0f)

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CHANY mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_ANY_CR_CHANY_MDEN_Pos       (0)                                     ///< CHANY_MDEN (Bit 0)
#define ADC_ANY_CR_CHANY_MDEN           (0x01U << ADC_ANY_CR_CHANY_MDEN_Pos)    ///< CHANY_MDEN (Bitfield-Mask: 0x01)
#define ADC1_CHANY_CR_MDEN_Pos          ADC_ANY_CR_CHANY_MDEN_Pos
#define ADC1_CHANY_CR_MDEN              ADC_ANY_CR_CHANY_MDEN

#define ADC_ANY_CR_JCEN_Pos             (1)
#define ADC_ANY_CR_JCEN                 (0x01U << ADC_ANY_CR_JCEN_Pos)          ///< Injected channel enable
#define ADC_ANY_CR_JEOSMPIE_Pos         (2)
#define ADC_ANY_CR_JEOSMPIE             (0x01U << ADC_ANY_CR_JEOSMPIE_Pos)      ///< Interrupt enable the end of sequence conversion for injected channel
#define ADC_ANY_CR_JEOCIE_Pos           (3)
#define ADC_ANY_CR_JEOCIE               (0x01U << ADC_ANY_CR_JEOCIE_Pos)        ///< Interrupt enable the end of conversion for injected channel
#define ADC_ANY_CR_JEOSIE_Pos           (4)
#define ADC_ANY_CR_JEOSIE               (0x01U << ADC_ANY_CR_JEOSIE_Pos)        ///< Interrupt enable the end of sequence conversion for injected channel
#define ADC_ANY_CR_JAUTO_Pos            (5)
#define ADC_ANY_CR_JAUTO                (0x01U << ADC_ANY_CR_JAUTO_Pos)         ///<Automatic Injected group conversion
#define ADC_ANY_CR_JADST_Pos            (6)
#define ADC_ANY_CR_JADST                (0x01U << ADC_ANY_CR_JADST_Pos)         ///< Start conversion of injected channels
#define ADC_ANY_CR_JTRGEN_Pos           (7)
#define ADC_ANY_CR_JTRGEN               (0x01U << ADC_ANY_CR_JTRGEN_Pos)        ///< External trigger conversion mode for injected channels
#define ADC_ANY_CR_JTRGSEL_Pos          (8)                                     ///< External event select for injected group
#define ADC_ANY_CR_JTRGSEL              (0x1FU << ADC_ANY_CR_JTRGSEL_Pos)
#define ADC_ANY_CR_JTRGSEL_TIM1_CC1     (0x00U << ADC_ANY_CR_JTRGSEL_Pos)       ///< TIM1  CC1
#define ADC_ANY_CR_JTRGSEL_TIM1_CC2     (0x01U << ADC_ANY_CR_JTRGSEL_Pos)       ///< TIM1  CC2
#define ADC_ANY_CR_JTRGSEL_TIM1_CC3     (0x02U << ADC_ANY_CR_JTRGSEL_Pos)       ///< TIM1  CC3
#define ADC_ANY_CR_JTRGSEL_TIM2_CC2     (0x03U << ADC_ANY_CR_JTRGSEL_Pos)       ///< TIM2  CC2
#define ADC_ANY_CR_JTRGSEL_TIM3_TRGO    (0x04U << ADC_ANY_CR_JTRGSEL_Pos)       ///< TIM3  TRGO
#define ADC_ANY_CR_JTRGSEL_TIM1_CC4_CC5 (0x05U << ADC_ANY_CR_JTRGSEL_Pos)       ///< TIM1  CC4 or CC5
#define ADC_ANY_CR_JTRGSEL_TIM3_CC1     (0x06U << ADC_ANY_CR_JTRGSEL_Pos)       ///< TIM3  CC1
#define ADC_ANY_CR_JTRGSEL_EXTI11       (0x07U << ADC_ANY_CR_JTRGSEL_Pos)       ///< EXTI11
#define ADC_ANY_CR_JTRGSEL_TIM1_TRGO    (0x08U << ADC_ANY_CR_JTRGSEL_Pos)       ///< TIM1  TRGO
#define ADC_ANY_CR_JTRGSEL_TIM8_CC4     (0x09U << ADC_ANY_CR_JTRGSEL_Pos)       ///< TIM8  CC4
#define ADC_ANY_CR_JTRGSEL_TIM8_CC4_CC5 (0x0AU << ADC_ANY_CR_JTRGSEL_Pos)       ///< TIM8 CC4 or CC5
#define ADC_ANY_CR_JTRGSEL_TIM2_CC1     (0x0BU << ADC_ANY_CR_JTRGSEL_Pos)       ///< TIM2   CC1
#define ADC_ANY_CR_JTRGSEL_TIM3_CC4     (0x0CU << ADC_ANY_CR_JTRGSEL_Pos)       ///< TIM3   CC4
#define ADC_ANY_CR_JTRGSEL_TIM2_TRGO    (0x0DU << ADC_ANY_CR_JTRGSEL_Pos)       ///< TIM2 TRGO
#define ADC_ANY_CR_JTRGSEL_TIM8_CC5     (0x0EU << ADC_ANY_CR_JTRGSEL_Pos)       ///< TIM8 CC5
#define ADC_ANY_CR_JTRGSEL_EXTI15       (0x0FU << ADC_ANY_CR_JTRGSEL_Pos)       ///< EXTI 15
#define ADC_ANY_CR_JTRGSEL_TIM1_CC4     (0x10U << ADC_ANY_CR_JTRGSEL_Pos)       ///< TIM1 CC4
#define ADC_ANY_CR_JTRGSEL_TIM1_CC5     (0x11U << ADC_ANY_CR_JTRGSEL_Pos)       ///< TIM1 CC5
#define ADC_ANY_CR_JTRGSEL_EXTI_15      ADC_ANY_CR_JTRGSEL_EXTI15
#define ADC_ANY_CR_JTRGSHIFT_Pos        (13)                                    ///< select the sample time of corresponding channel
#define ADC_ANY_CR_JTRGSHIFT_0          (0x00U << ADC_ANY_CR_JTRGSHIFT_Pos)     ///< 0   cycle
#define ADC_ANY_CR_JTRGSHIFT_4          (0x01U << ADC_ANY_CR_JTRGSHIFT_Pos)     ///< 4   cycle
#define ADC_ANY_CR_JTRGSHIFT_16         (0x02U << ADC_ANY_CR_JTRGSHIFT_Pos)     ///< 16  cycle
#define ADC_ANY_CR_JTRGSHIFT_32         (0x03U << ADC_ANY_CR_JTRGSHIFT_Pos)     ///< 32  cycle
#define ADC_ANY_CR_JTRGSHIFT_64         (0x04U << ADC_ANY_CR_JTRGSHIFT_Pos)     ///< 64  cycle
#define ADC_ANY_CR_JTRGSHIFT_128        (0x05U << ADC_ANY_CR_JTRGSHIFT_Pos)     ///< 128 cycle
#define ADC_ANY_CR_JTRGSHIFT_256        (0x06U << ADC_ANY_CR_JTRGSHIFT_Pos)     ///< 256 cycle
#define ADC_ANY_CR_JTRGSHIFT_512        (0x07U << ADC_ANY_CR_JTRGSHIFT_Pos)     ///< 512 cycle
#define ADC_ANY_CR_JTRGEDGE_Pos         (16)                                    ///< Injection mode triggers edge selection
#define ADC_ANY_CR_JTRGEDGE_R_F         (0x00U << ADC_ANY_CR_JTRGEDGE_Pos)      ///< Triggered along both rising and falling edges
#define ADC_ANY_CR_JTRGEDGE_F           (0x01U << ADC_ANY_CR_JTRGEDGE_Pos)      ///< Drop edge trigger
#define ADC_ANY_CR_JTRGEDGE_R           (0x02U << ADC_ANY_CR_JTRGEDGE_Pos)      ///< Rising edge trigger
#define ADC_ANY_CR_JTRGEDGE_S           (0x03U << ADC_ANY_CR_JTRGEDGE_Pos)      ///< Shield trigger

#define ADC_ANY_CR_ADCAL_Pos            (20)
#define ADC_ANY_CR_ADCAL                (0x01U << ADC_ANY_CR_ADCAL_Pos)         ///< Calibration finish
#define ADC_ANY_CR_EOCALIE_Pos          (21)
#define ADC_ANY_CR_EOCALIE              (0x01U << ADC_ANY_CR_EOCALIE_Pos)       ///< End of calibration interrupt enable

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_ADCFG2 config  Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_ADCFG2_CORREN_Pos           (0)
#define ADC_ADCFG2_CORREN               (0x01U << ADC_ADCFG2_CORREN_Pos)        ///< Conversion correction enable
#define ADC_ADCFG2_ADCCR_Pos            (1)
#define ADC_ADCFG2_ADCCR                (0x01U << ADC_ADCFG2_ADCCR_Pos)         ///< Reference voltage selection
#define ADC_ADCFG2_ADCSREF_Pos          (2)
#define ADC_ADCFG2_ADCSREF              (0x01U << ADC_ADCFG2_ADCSREF_Pos)       ///< Reference voltage selection
#define ADC_ADCFG2_CORRVSEL_Pos         (3)
#define ADC_ADCFG2_CORRVSEL             (0x01U << ADC_ADCFG2_CORRVSEL_Pos)      ///< correct vref select 15/16 Vref
#define ADC_ADCFG2_DC_Pos               (4)
#define ADC_ADCFG2_DC_0_1               (0x01U << ADC_ADCFG2_DC_Pos)            ///< Differential channel select 0_1
#define ADC_ADCFG2_DC_2_3               (0x02U << ADC_ADCFG2_DC_Pos)            ///< Differential channel select 2_3
#define ADC_ADCFG2_DC_4_5               (0x04U << ADC_ADCFG2_DC_Pos)            ///< Differential channel select 4_5
#define ADC_ADCFG2_DC_6_7               (0x08U << ADC_ADCFG2_DC_Pos)            ///< Differential channel select 6_7
#define ADC_ADCFG2_DC_12_13             (0x10U << ADC_ADCFG2_DC_Pos)            ///< Differential channel select 12_13
#define ADC_ADCFG2_PSDC_Pos             (10)
#define ADC_ADCFG2_PSDC_0_1             (0x01U << ADC_ADCFG2_PSDC_Pos)          ///< Pseudo differential channel select 0_1
#define ADC_ADCFG2_PSDC_2_3             (0x02U << ADC_ADCFG2_PSDC_Pos)          ///< Pseudo differential channel select 2_3
#define ADC_ADCFG2_PSDC_4_5             (0x04U << ADC_ADCFG2_PSDC_Pos)          ///< Pseudo differential channel select 4_5
#define ADC_ADCFG2_PSDC_6_7             (0x08U << ADC_ADCFG2_PSDC_Pos)          ///< Pseudo differential channel select 6_7
#define ADC_ADCFG2_PSDC_12_13           (0x10U << ADC_ADCFG2_PSDC_Pos)          ///< Pseudo differential channel select 12_13
#define ADC_ADCFG2_ADCALPRE_Pos         (15)
#define ADC_ADCFG2_ADCALPRE             (0x01U << ADC_ADCFG2_ADCALPRE_Pos)      ///< calibration clk frequency division

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_SMPR1 mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_SMPR_SAMCTL_Pos             (0)                                     ///< select the sample time of corresponding channel off_set Position
#define ADC_SMPR_SAMCTL_Msk             (0x0FU << ADC_SMPR_SAMCTL_Pos)          ///< select the sample time of corresponding channel mask for Value
#define ADC_SMPR_SAMCTL_SEL_0           (0x00U << ADC_SMPR_SAMCTL_Pos)          ///< 3_5     cycle
#define ADC_SMPR_SAMCTL_SEL_1           (0x01U << ADC_SMPR_SAMCTL_Pos)          ///< 4_5     cycle
#define ADC_SMPR_SAMCTL_SEL_2           (0x02U << ADC_SMPR_SAMCTL_Pos)          ///< 5_5     cycle
#define ADC_SMPR_SAMCTL_SEL_3           (0x03U << ADC_SMPR_SAMCTL_Pos)          ///< 6_5     cycle
#define ADC_SMPR_SAMCTL_SEL_4           (0x04U << ADC_SMPR_SAMCTL_Pos)          ///< 7_5     cycle
#define ADC_SMPR_SAMCTL_SEL_5           (0x05U << ADC_SMPR_SAMCTL_Pos)          ///< 11_5    cycle
#define ADC_SMPR_SAMCTL_SEL_6           (0x06U << ADC_SMPR_SAMCTL_Pos)          ///< 13_5    cycle
#define ADC_SMPR_SAMCTL_SEL_7           (0x07U << ADC_SMPR_SAMCTL_Pos)          ///< 15_5    cycle
#define ADC_SMPR_SAMCTL_SEL_8           (0x08U << ADC_SMPR_SAMCTL_Pos)          ///< 19_5    cycle
#define ADC_SMPR_SAMCTL_SEL_9           (0x09U << ADC_SMPR_SAMCTL_Pos)          ///< 29_5    cycle
#define ADC_SMPR_SAMCTL_SEL_10          (0x0AU << ADC_SMPR_SAMCTL_Pos)          ///< 39_5    cycle
#define ADC_SMPR_SAMCTL_SEL_11          (0x0BU << ADC_SMPR_SAMCTL_Pos)          ///< 59_5    cycle
#define ADC_SMPR_SAMCTL_SEL_12          (0x0CU << ADC_SMPR_SAMCTL_Pos)          ///< 79_5    cycle
#define ADC_SMPR_SAMCTL_SEL_13          (0x0DU << ADC_SMPR_SAMCTL_Pos)          ///< 119_5   cycle
#define ADC_SMPR_SAMCTL_SEL_14          (0x0EU << ADC_SMPR_SAMCTL_Pos)          ///< 159_5   cycle
#define ADC_SMPR_SAMCTL_SEL_15          (0x0FU << ADC_SMPR_SAMCTL_Pos)          ///< 240_5   cycle

