SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32SPIN0280/MM32SPIN0280_Bootloader/Device/MM32SPIN0280/Include/reg_adc.h
#define ADC_SMPR_SAMCTL_3_5             (0x00U << ADC_SMPR_SAMCTL_Pos)          ///< 3_5     cycle
#define ADC_SMPR_SAMCTL_4_5             (0x01U << ADC_SMPR_SAMCTL_Pos)          ///< 4_5     cycle
#define ADC_SMPR_SAMCTL_5_5             (0x02U << ADC_SMPR_SAMCTL_Pos)          ///< 5_5     cycle
#define ADC_SMPR_SAMCTL_6_5             (0x03U << ADC_SMPR_SAMCTL_Pos)          ///< 6_5     cycle
#define ADC_SMPR_SAMCTL_7_5             (0x04U << ADC_SMPR_SAMCTL_Pos)          ///< 7_5     cycle
#define ADC_SMPR_SAMCTL_11_5            (0x05U << ADC_SMPR_SAMCTL_Pos)          ///< 11_5    cycle
#define ADC_SMPR_SAMCTL_13_5            (0x06U << ADC_SMPR_SAMCTL_Pos)          ///< 13_5    cycle
#define ADC_SMPR_SAMCTL_15_5            (0x07U << ADC_SMPR_SAMCTL_Pos)          ///< 15_5    cycle
#define ADC_SMPR_SAMCTL_19_5            (0x08U << ADC_SMPR_SAMCTL_Pos)          ///< 19_5    cycle
#define ADC_SMPR_SAMCTL_29_5            (0x09U << ADC_SMPR_SAMCTL_Pos)          ///< 29_5    cycle
#define ADC_SMPR_SAMCTL_39_5            (0x0AU << ADC_SMPR_SAMCTL_Pos)          ///< 39_5    cycle
#define ADC_SMPR_SAMCTL_59_5            (0x0BU << ADC_SMPR_SAMCTL_Pos)          ///< 59_5    cycle
#define ADC_SMPR_SAMCTL_79_5            (0x0CU << ADC_SMPR_SAMCTL_Pos)          ///< 79_5    cycle
#define ADC_SMPR_SAMCTL_119_5           (0x0DU << ADC_SMPR_SAMCTL_Pos)          ///< 119_5   cycle
#define ADC_SMPR_SAMCTL_159_5           (0x0EU << ADC_SMPR_SAMCTL_Pos)          ///< 159_5   cycle
#define ADC_SMPR_SAMCTL_240_5           (0x0FU << ADC_SMPR_SAMCTL_Pos)          ///< 240_5   cycle

#define ADC_SMPR_SAMCTL_Pos_ShiftStep   (4)

#define ADC_SMPR1_SAMCTL0_Pos           (0)                                     ///< select the sample time of corresponding channel off_set Position
#define ADC_SMPR1_SAMCTL0_Msk           (0x0FU << ADC_SMPR1_SAMCTL0_Pos)        ///< select the sample time of corresponding channel mask for Value
#define ADC_SMPR1_SAMCTL0_3_5           (0x00U << ADC_SMPR1_SAMCTL0_Pos)        ///< 3_5     cycle
#define ADC_SMPR1_SAMCTL0_4_5           (0x01U << ADC_SMPR1_SAMCTL0_Pos)        ///< 4_5     cycle
#define ADC_SMPR1_SAMCTL0_5_5           (0x02U << ADC_SMPR1_SAMCTL0_Pos)        ///< 5_5     cycle
#define ADC_SMPR1_SAMCTL0_6_5           (0x03U << ADC_SMPR1_SAMCTL0_Pos)        ///< 6_5     cycle
#define ADC_SMPR1_SAMCTL0_7_5           (0x04U << ADC_SMPR1_SAMCTL0_Pos)        ///< 7_5     cycle
#define ADC_SMPR1_SAMCTL0_11_5          (0x05U << ADC_SMPR1_SAMCTL0_Pos)        ///< 11_5    cycle
#define ADC_SMPR1_SAMCTL0_13_5          (0x06U << ADC_SMPR1_SAMCTL0_Pos)        ///< 13_5    cycle
#define ADC_SMPR1_SAMCTL0_15_5          (0x07U << ADC_SMPR1_SAMCTL0_Pos)        ///< 15_5    cycle
#define ADC_SMPR1_SAMCTL0_19_5          (0x08U << ADC_SMPR1_SAMCTL0_Pos)        ///< 19_5    cycle
#define ADC_SMPR1_SAMCTL0_29_5          (0x09U << ADC_SMPR1_SAMCTL0_Pos)        ///< 29_5    cycle
#define ADC_SMPR1_SAMCTL0_39_5          (0x0AU << ADC_SMPR1_SAMCTL0_Pos)        ///< 39_5    cycle
#define ADC_SMPR1_SAMCTL0_59_5          (0x0BU << ADC_SMPR1_SAMCTL0_Pos)        ///< 59_5    cycle
#define ADC_SMPR1_SAMCTL0_79_5          (0x0CU << ADC_SMPR1_SAMCTL0_Pos)        ///< 79_5    cycle
#define ADC_SMPR1_SAMCTL0_119_5         (0x0DU << ADC_SMPR1_SAMCTL0_Pos)        ///< 119_5   cycle
#define ADC_SMPR1_SAMCTL0_159_5         (0x0EU << ADC_SMPR1_SAMCTL0_Pos)        ///< 159_5   cycle
#define ADC_SMPR1_SAMCTL0_240_5         (0x0FU << ADC_SMPR1_SAMCTL0_Pos)        ///< 240_5   cycle
#define ADC_SMPR1_SAMCTL1_Pos           (4)                                     ///< select the sample time of corresponding channel off_set Position
#define ADC_SMPR1_SAMCTL1_Msk           (0x0FU << ADC_SMPR1_SAMCTL1_Pos)        ///< select the sample time of corresponding channel mask for Value
#define ADC_SMPR1_SAMCTL1_3_5           (0x00U << ADC_SMPR1_SAMCTL1_Pos)        ///< 3_5     cycle
#define ADC_SMPR1_SAMCTL1_4_5           (0x01U << ADC_SMPR1_SAMCTL1_Pos)        ///< 4_5     cycle
#define ADC_SMPR1_SAMCTL1_5_5           (0x02U << ADC_SMPR1_SAMCTL1_Pos)        ///< 5_5     cycle
#define ADC_SMPR1_SAMCTL1_6_5           (0x03U << ADC_SMPR1_SAMCTL1_Pos)        ///< 6_5     cycle
#define ADC_SMPR1_SAMCTL1_7_5           (0x04U << ADC_SMPR1_SAMCTL1_Pos)        ///< 7_5     cycle
#define ADC_SMPR1_SAMCTL1_11_5          (0x05U << ADC_SMPR1_SAMCTL1_Pos)        ///< 11_5    cycle
#define ADC_SMPR1_SAMCTL1_13_5          (0x06U << ADC_SMPR1_SAMCTL1_Pos)        ///< 13_5    cycle
#define ADC_SMPR1_SAMCTL1_15_5          (0x07U << ADC_SMPR1_SAMCTL1_Pos)        ///< 15_5    cycle
#define ADC_SMPR1_SAMCTL1_19_5          (0x08U << ADC_SMPR1_SAMCTL1_Pos)        ///< 19_5    cycle
#define ADC_SMPR1_SAMCTL1_29_5          (0x09U << ADC_SMPR1_SAMCTL1_Pos)        ///< 29_5    cycle
#define ADC_SMPR1_SAMCTL1_39_5          (0x0AU << ADC_SMPR1_SAMCTL1_Pos)        ///< 39_5    cycle
#define ADC_SMPR1_SAMCTL1_59_5          (0x0BU << ADC_SMPR1_SAMCTL1_Pos)        ///< 59_5    cycle
#define ADC_SMPR1_SAMCTL1_79_5          (0x0CU << ADC_SMPR1_SAMCTL1_Pos)        ///< 79_5    cycle
#define ADC_SMPR1_SAMCTL1_119_5         (0x0DU << ADC_SMPR1_SAMCTL1_Pos)        ///< 119_5   cycle
#define ADC_SMPR1_SAMCTL1_159_5         (0x0EU << ADC_SMPR1_SAMCTL1_Pos)        ///< 159_5   cycle
#define ADC_SMPR1_SAMCTL1_240_5         (0x0FU << ADC_SMPR1_SAMCTL1_Pos)        ///< 240_5   cycle
#define ADC_SMPR1_SAMCTL2_Pos           (8)                                     ///< select the sample time of corresponding channel off_set Position
#define ADC_SMPR1_SAMCTL2_Msk           (0x0FU << ADC_SMPR1_SAMCTL2_Pos)        ///< select the sample time of corresponding channel mask for Value
#define ADC_SMPR1_SAMCTL2_3_5           (0x00U << ADC_SMPR1_SAMCTL2_Pos)        ///< 3_5     cycle
#define ADC_SMPR1_SAMCTL2_4_5           (0x01U << ADC_SMPR1_SAMCTL2_Pos)        ///< 4_5     cycle
#define ADC_SMPR1_SAMCTL2_5_5           (0x02U << ADC_SMPR1_SAMCTL2_Pos)        ///< 5_5     cycle
#define ADC_SMPR1_SAMCTL2_6_5           (0x03U << ADC_SMPR1_SAMCTL2_Pos)        ///< 6_5     cycle
#define ADC_SMPR1_SAMCTL2_7_5           (0x04U << ADC_SMPR1_SAMCTL2_Pos)        ///< 7_5     cycle
#define ADC_SMPR1_SAMCTL2_11_5          (0x05U << ADC_SMPR1_SAMCTL2_Pos)        ///< 11_5    cycle
#define ADC_SMPR1_SAMCTL2_13_5          (0x06U << ADC_SMPR1_SAMCTL2_Pos)        ///< 13_5    cycle
#define ADC_SMPR1_SAMCTL2_15_5          (0x07U << ADC_SMPR1_SAMCTL2_Pos)        ///< 15_5    cycle
#define ADC_SMPR1_SAMCTL2_19_5          (0x08U << ADC_SMPR1_SAMCTL2_Pos)        ///< 19_5    cycle
#define ADC_SMPR1_SAMCTL2_29_5          (0x09U << ADC_SMPR1_SAMCTL2_Pos)        ///< 29_5    cycle
#define ADC_SMPR1_SAMCTL2_39_5          (0x0AU << ADC_SMPR1_SAMCTL2_Pos)        ///< 39_5    cycle
#define ADC_SMPR1_SAMCTL2_59_5          (0x0BU << ADC_SMPR1_SAMCTL2_Pos)        ///< 59_5    cycle
#define ADC_SMPR1_SAMCTL2_79_5          (0x0CU << ADC_SMPR1_SAMCTL2_Pos)        ///< 79_5    cycle
#define ADC_SMPR1_SAMCTL2_119_5         (0x0DU << ADC_SMPR1_SAMCTL2_Pos)        ///< 119_5   cycle
#define ADC_SMPR1_SAMCTL2_159_5         (0x0EU << ADC_SMPR1_SAMCTL2_Pos)        ///< 159_5   cycle
#define ADC_SMPR1_SAMCTL2_240_5         (0x0FU << ADC_SMPR1_SAMCTL2_Pos)        ///< 240_5   cycle
#define ADC_SMPR1_SAMCTL3_Pos           (12)                                    ///< select the sample time of corresponding channel off_set Position
#define ADC_SMPR1_SAMCTL3_Msk           (0x0FU << ADC_SMPR1_SAMCTL3_Pos)        ///< select the sample time of corresponding channel mask for Value
#define ADC_SMPR1_SAMCTL3_3_5           (0x00U << ADC_SMPR1_SAMCTL3_Pos)        ///< 3_5     cycle
#define ADC_SMPR1_SAMCTL3_4_5           (0x01U << ADC_SMPR1_SAMCTL3_Pos)        ///< 4_5     cycle
#define ADC_SMPR1_SAMCTL3_5_5           (0x02U << ADC_SMPR1_SAMCTL3_Pos)        ///< 5_5     cycle
#define ADC_SMPR1_SAMCTL3_6_5           (0x03U << ADC_SMPR1_SAMCTL3_Pos)        ///< 6_5     cycle
#define ADC_SMPR1_SAMCTL3_7_5           (0x04U << ADC_SMPR1_SAMCTL3_Pos)        ///< 7_5     cycle
#define ADC_SMPR1_SAMCTL3_11_5          (0x05U << ADC_SMPR1_SAMCTL3_Pos)        ///< 11_5    cycle
#define ADC_SMPR1_SAMCTL3_13_5          (0x06U << ADC_SMPR1_SAMCTL3_Pos)        ///< 13_5    cycle
#define ADC_SMPR1_SAMCTL3_15_5          (0x07U << ADC_SMPR1_SAMCTL3_Pos)        ///< 15_5    cycle
#define ADC_SMPR1_SAMCTL3_19_5          (0x08U << ADC_SMPR1_SAMCTL3_Pos)        ///< 19_5    cycle
#define ADC_SMPR1_SAMCTL3_29_5          (0x09U << ADC_SMPR1_SAMCTL3_Pos)        ///< 29_5    cycle
#define ADC_SMPR1_SAMCTL3_39_5          (0x0AU << ADC_SMPR1_SAMCTL3_Pos)        ///< 39_5    cycle
#define ADC_SMPR1_SAMCTL3_59_5          (0x0BU << ADC_SMPR1_SAMCTL3_Pos)        ///< 59_5    cycle
#define ADC_SMPR1_SAMCTL3_79_5          (0x0CU << ADC_SMPR1_SAMCTL3_Pos)        ///< 79_5    cycle
#define ADC_SMPR1_SAMCTL3_119_5         (0x0DU << ADC_SMPR1_SAMCTL3_Pos)        ///< 119_5   cycle
#define ADC_SMPR1_SAMCTL3_159_5         (0x0EU << ADC_SMPR1_SAMCTL3_Pos)        ///< 159_5   cycle
#define ADC_SMPR1_SAMCTL3_240_5         (0x0FU << ADC_SMPR1_SAMCTL3_Pos)        ///< 240_5   cycle
#define ADC_SMPR1_SAMCTL4_Pos           (16)                                    ///< select the sample time of corresponding channel off_set Position
#define ADC_SMPR1_SAMCTL4_Msk           (0x0FU << ADC_SMPR1_SAMCTL4_Pos)        ///< select the sample time of corresponding channel mask for Value
#define ADC_SMPR1_SAMCTL4_3_5           (0x00U << ADC_SMPR1_SAMCTL4_Pos)        ///< 3_5     cycle
#define ADC_SMPR1_SAMCTL4_4_5           (0x01U << ADC_SMPR1_SAMCTL4_Pos)        ///< 4_5     cycle
#define ADC_SMPR1_SAMCTL4_5_5           (0x02U << ADC_SMPR1_SAMCTL4_Pos)        ///< 5_5     cycle
#define ADC_SMPR1_SAMCTL4_6_5           (0x03U << ADC_SMPR1_SAMCTL4_Pos)        ///< 6_5     cycle
#define ADC_SMPR1_SAMCTL4_7_5           (0x04U << ADC_SMPR1_SAMCTL4_Pos)        ///< 7_5     cycle
#define ADC_SMPR1_SAMCTL4_11_5          (0x05U << ADC_SMPR1_SAMCTL4_Pos)        ///< 11_5    cycle
#define ADC_SMPR1_SAMCTL4_13_5          (0x06U << ADC_SMPR1_SAMCTL4_Pos)        ///< 13_5    cycle
#define ADC_SMPR1_SAMCTL4_15_5          (0x07U << ADC_SMPR1_SAMCTL4_Pos)        ///< 15_5    cycle
#define ADC_SMPR1_SAMCTL4_19_5          (0x08U << ADC_SMPR1_SAMCTL4_Pos)        ///< 19_5    cycle
#define ADC_SMPR1_SAMCTL4_29_5          (0x09U << ADC_SMPR1_SAMCTL4_Pos)        ///< 29_5    cycle
#define ADC_SMPR1_SAMCTL4_39_5          (0x0AU << ADC_SMPR1_SAMCTL4_Pos)        ///< 39_5    cycle
#define ADC_SMPR1_SAMCTL4_59_5          (0x0BU << ADC_SMPR1_SAMCTL4_Pos)        ///< 59_5    cycle
#define ADC_SMPR1_SAMCTL4_79_5          (0x0CU << ADC_SMPR1_SAMCTL4_Pos)        ///< 79_5    cycle
#define ADC_SMPR1_SAMCTL4_119_5         (0x0DU << ADC_SMPR1_SAMCTL4_Pos)        ///< 119_5   cycle
#define ADC_SMPR1_SAMCTL4_159_5         (0x0EU << ADC_SMPR1_SAMCTL4_Pos)        ///< 159_5   cycle
#define ADC_SMPR1_SAMCTL4_240_5         (0x0FU << ADC_SMPR1_SAMCTL4_Pos)        ///< 240_5   cycle
#define ADC_SMPR1_SAMCTL5_Pos           (20)                                    ///< select the sample time of corresponding channel off_set Position
#define ADC_SMPR1_SAMCTL5_Msk           (0x0FU << ADC_SMPR1_SAMCTL5_Pos)        ///< select the sample time of corresponding channel mask for Value
#define ADC_SMPR1_SAMCTL5_3_5           (0x00U << ADC_SMPR1_SAMCTL5_Pos)        ///< 3_5     cycle
#define ADC_SMPR1_SAMCTL5_4_5           (0x01U << ADC_SMPR1_SAMCTL5_Pos)        ///< 4_5     cycle
#define ADC_SMPR1_SAMCTL5_5_5           (0x02U << ADC_SMPR1_SAMCTL5_Pos)        ///< 5_5     cycle
#define ADC_SMPR1_SAMCTL5_6_5           (0x03U << ADC_SMPR1_SAMCTL5_Pos)        ///< 6_5     cycle
#define ADC_SMPR1_SAMCTL5_7_5           (0x04U << ADC_SMPR1_SAMCTL5_Pos)        ///< 7_5     cycle
#define ADC_SMPR1_SAMCTL5_11_5          (0x05U << ADC_SMPR1_SAMCTL5_Pos)        ///< 11_5    cycle
#define ADC_SMPR1_SAMCTL5_13_5          (0x06U << ADC_SMPR1_SAMCTL5_Pos)        ///< 13_5    cycle
#define ADC_SMPR1_SAMCTL5_15_5          (0x07U << ADC_SMPR1_SAMCTL5_Pos)        ///< 15_5    cycle
#define ADC_SMPR1_SAMCTL5_19_5          (0x08U << ADC_SMPR1_SAMCTL5_Pos)        ///< 19_5    cycle
#define ADC_SMPR1_SAMCTL5_29_5          (0x09U << ADC_SMPR1_SAMCTL5_Pos)        ///< 29_5    cycle
#define ADC_SMPR1_SAMCTL5_39_5          (0x0AU << ADC_SMPR1_SAMCTL5_Pos)        ///< 39_5    cycle
#define ADC_SMPR1_SAMCTL5_59_5          (0x0BU << ADC_SMPR1_SAMCTL5_Pos)        ///< 59_5    cycle
#define ADC_SMPR1_SAMCTL5_79_5          (0x0CU << ADC_SMPR1_SAMCTL5_Pos)        ///< 79_5    cycle
#define ADC_SMPR1_SAMCTL5_119_5         (0x0DU << ADC_SMPR1_SAMCTL5_Pos)        ///< 119_5   cycle
#define ADC_SMPR1_SAMCTL5_159_5         (0x0EU << ADC_SMPR1_SAMCTL5_Pos)        ///< 159_5   cycle
#define ADC_SMPR1_SAMCTL5_240_5         (0x0FU << ADC_SMPR1_SAMCTL5_Pos)        ///< 240_5   cycle
#define ADC_SMPR1_SAMCTL6_Pos           (24)                                    ///< select the sample time of corresponding channel off_set Position
#define ADC_SMPR1_SAMCTL6_Msk           (0x0FU << ADC_SMPR1_SAMCTL6_Pos)        ///< select the sample time of corresponding channel mask for Value
#define ADC_SMPR1_SAMCTL6_3_5           (0x00U << ADC_SMPR1_SAMCTL6_Pos)        ///< 3_5     cycle
#define ADC_SMPR1_SAMCTL6_4_5           (0x01U << ADC_SMPR1_SAMCTL6_Pos)        ///< 4_5     cycle
#define ADC_SMPR1_SAMCTL6_5_5           (0x02U << ADC_SMPR1_SAMCTL6_Pos)        ///< 5_5     cycle
#define ADC_SMPR1_SAMCTL6_6_5           (0x03U << ADC_SMPR1_SAMCTL6_Pos)        ///< 6_5     cycle
#define ADC_SMPR1_SAMCTL6_7_5           (0x04U << ADC_SMPR1_SAMCTL6_Pos)        ///< 7_5     cycle
#define ADC_SMPR1_SAMCTL6_11_5          (0x05U << ADC_SMPR1_SAMCTL6_Pos)        ///< 11_5    cycle
#define ADC_SMPR1_SAMCTL6_13_5          (0x06U << ADC_SMPR1_SAMCTL6_Pos)        ///< 13_5    cycle
#define ADC_SMPR1_SAMCTL6_15_5          (0x07U << ADC_SMPR1_SAMCTL6_Pos)        ///< 15_5    cycle
#define ADC_SMPR1_SAMCTL6_19_5          (0x08U << ADC_SMPR1_SAMCTL6_Pos)        ///< 19_5    cycle
#define ADC_SMPR1_SAMCTL6_29_5          (0x09U << ADC_SMPR1_SAMCTL6_Pos)        ///< 29_5    cycle
#define ADC_SMPR1_SAMCTL6_39_5          (0x0AU << ADC_SMPR1_SAMCTL6_Pos)        ///< 39_5    cycle
#define ADC_SMPR1_SAMCTL6_59_5          (0x0BU << ADC_SMPR1_SAMCTL6_Pos)        ///< 59_5    cycle
#define ADC_SMPR1_SAMCTL6_79_5          (0x0CU << ADC_SMPR1_SAMCTL6_Pos)        ///< 79_5    cycle
#define ADC_SMPR1_SAMCTL6_119_5         (0x0DU << ADC_SMPR1_SAMCTL6_Pos)        ///< 119_5   cycle
#define ADC_SMPR1_SAMCTL6_159_5         (0x0EU << ADC_SMPR1_SAMCTL6_Pos)        ///< 159_5   cycle
#define ADC_SMPR1_SAMCTL6_240_5         (0x0FU << ADC_SMPR1_SAMCTL6_Pos)        ///< 240_5   cycle
#define ADC_SMPR1_SAMCTL7_Pos           (28)                                    ///< select the sample time of corresponding channel off_set Position
#define ADC_SMPR1_SAMCTL7_Msk           (0x0FU << ADC_SMPR1_SAMCTL7_Pos)        ///< select the sample time of corresponding channel mask for Value
#define ADC_SMPR1_SAMCTL7_3_5           (0x00U << ADC_SMPR1_SAMCTL7_Pos)        ///< 3_5     cycle
#define ADC_SMPR1_SAMCTL7_4_5           (0x01U << ADC_SMPR1_SAMCTL7_Pos)        ///< 4_5     cycle
#define ADC_SMPR1_SAMCTL7_5_5           (0x02U << ADC_SMPR1_SAMCTL7_Pos)        ///< 5_5     cycle
#define ADC_SMPR1_SAMCTL7_6_5           (0x03U << ADC_SMPR1_SAMCTL7_Pos)        ///< 6_5     cycle
#define ADC_SMPR1_SAMCTL7_7_5           (0x04U << ADC_SMPR1_SAMCTL7_Pos)        ///< 7_5     cycle
#define ADC_SMPR1_SAMCTL7_11_5          (0x05U << ADC_SMPR1_SAMCTL7_Pos)        ///< 11_5    cycle
#define ADC_SMPR1_SAMCTL7_13_5          (0x06U << ADC_SMPR1_SAMCTL7_Pos)        ///< 13_5    cycle
#define ADC_SMPR1_SAMCTL7_15_5          (0x07U << ADC_SMPR1_SAMCTL7_Pos)        ///< 15_5    cycle
#define ADC_SMPR1_SAMCTL7_19_5          (0x08U << ADC_SMPR1_SAMCTL7_Pos)        ///< 19_5    cycle
#define ADC_SMPR1_SAMCTL7_29_5          (0x09U << ADC_SMPR1_SAMCTL7_Pos)        ///< 29_5    cycle
#define ADC_SMPR1_SAMCTL7_39_5          (0x0AU << ADC_SMPR1_SAMCTL7_Pos)        ///< 39_5    cycle
#define ADC_SMPR1_SAMCTL7_59_5          (0x0BU << ADC_SMPR1_SAMCTL7_Pos)        ///< 59_5    cycle
#define ADC_SMPR1_SAMCTL7_79_5          (0x0CU << ADC_SMPR1_SAMCTL7_Pos)        ///< 79_5    cycle
#define ADC_SMPR1_SAMCTL7_119_5         (0x0DU << ADC_SMPR1_SAMCTL7_Pos)        ///< 119_5   cycle
#define ADC_SMPR1_SAMCTL7_159_5         (0x0EU << ADC_SMPR1_SAMCTL7_Pos)        ///< 159_5   cycle
#define ADC_SMPR1_SAMCTL7_240_5         (0x0FU << ADC_SMPR1_SAMCTL7_Pos)        ///< 240_5   cycle

