SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32SPIN0280/MM32SPIN0280_Bootloader/Device/MM32SPIN0280/Include/reg_adc.h
////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_SMPR2 mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_SMPR2_SAMCTL8_Pos           (0)                                     ///< select the sample time of corresponding channel off_set Position
#define ADC_SMPR2_SAMCTL8_Msk           (0x0FU << ADC_SMPR2_SAMCTL8_Pos)        ///< select the sample time of corresponding channel mask for Value
#define ADC_SMPR2_SAMCTL8_3_5           (0x00U << ADC_SMPR2_SAMCTL8_Pos)        ///< 3_5     cycle
#define ADC_SMPR2_SAMCTL8_4_5           (0x01U << ADC_SMPR2_SAMCTL8_Pos)        ///< 4_5     cycle
#define ADC_SMPR2_SAMCTL8_5_5           (0x02U << ADC_SMPR2_SAMCTL8_Pos)        ///< 5_5     cycle
#define ADC_SMPR2_SAMCTL8_6_5           (0x03U << ADC_SMPR2_SAMCTL8_Pos)        ///< 6_5     cycle
#define ADC_SMPR2_SAMCTL8_7_5           (0x04U << ADC_SMPR2_SAMCTL8_Pos)        ///< 7_5     cycle
#define ADC_SMPR2_SAMCTL8_11_5          (0x05U << ADC_SMPR2_SAMCTL8_Pos)        ///< 11_5    cycle
#define ADC_SMPR2_SAMCTL8_13_5          (0x06U << ADC_SMPR2_SAMCTL8_Pos)        ///< 13_5    cycle
#define ADC_SMPR2_SAMCTL8_15_5          (0x07U << ADC_SMPR2_SAMCTL8_Pos)        ///< 15_5    cycle
#define ADC_SMPR2_SAMCTL8_19_5          (0x08U << ADC_SMPR2_SAMCTL8_Pos)        ///< 19_5    cycle
#define ADC_SMPR2_SAMCTL8_29_5          (0x09U << ADC_SMPR2_SAMCTL8_Pos)        ///< 29_5    cycle
#define ADC_SMPR2_SAMCTL8_39_5          (0x0AU << ADC_SMPR2_SAMCTL8_Pos)        ///< 39_5    cycle
#define ADC_SMPR2_SAMCTL8_59_5          (0x0BU << ADC_SMPR2_SAMCTL8_Pos)        ///< 59_5    cycle
#define ADC_SMPR2_SAMCTL8_79_5          (0x0CU << ADC_SMPR2_SAMCTL8_Pos)        ///< 79_5    cycle
#define ADC_SMPR2_SAMCTL8_119_5         (0x0DU << ADC_SMPR2_SAMCTL8_Pos)        ///< 119_5   cycle
#define ADC_SMPR2_SAMCTL8_159_5         (0x0EU << ADC_SMPR2_SAMCTL8_Pos)        ///< 159_5   cycle
#define ADC_SMPR2_SAMCTL8_240_5         (0x0FU << ADC_SMPR2_SAMCTL8_Pos)        ///< 240_5   cycle
#define ADC_SMPR2_SAMCTL9_Pos           (4)                                     ///< select the sample time of corresponding channel off_set Position
#define ADC_SMPR2_SAMCTL9_Msk           (0x0FU << ADC_SMPR2_SAMCTL9_Pos)        ///< select the sample time of corresponding channel mask for Value
#define ADC_SMPR2_SAMCTL9_3_5           (0x00U << ADC_SMPR2_SAMCTL9_Pos)        ///< 3_5     cycle
#define ADC_SMPR2_SAMCTL9_4_5           (0x01U << ADC_SMPR2_SAMCTL9_Pos)        ///< 4_5     cycle
#define ADC_SMPR2_SAMCTL9_5_5           (0x02U << ADC_SMPR2_SAMCTL9_Pos)        ///< 5_5     cycle
#define ADC_SMPR2_SAMCTL9_6_5           (0x03U << ADC_SMPR2_SAMCTL9_Pos)        ///< 6_5     cycle
#define ADC_SMPR2_SAMCTL9_7_5           (0x04U << ADC_SMPR2_SAMCTL9_Pos)        ///< 7_5     cycle
#define ADC_SMPR2_SAMCTL9_11_5          (0x05U << ADC_SMPR2_SAMCTL9_Pos)        ///< 11_5    cycle
#define ADC_SMPR2_SAMCTL9_13_5          (0x06U << ADC_SMPR2_SAMCTL9_Pos)        ///< 13_5    cycle
#define ADC_SMPR2_SAMCTL9_15_5          (0x07U << ADC_SMPR2_SAMCTL9_Pos)        ///< 15_5    cycle
#define ADC_SMPR2_SAMCTL9_19_5          (0x08U << ADC_SMPR2_SAMCTL9_Pos)        ///< 19_5    cycle
#define ADC_SMPR2_SAMCTL9_29_5          (0x09U << ADC_SMPR2_SAMCTL9_Pos)        ///< 29_5    cycle
#define ADC_SMPR2_SAMCTL9_39_5          (0x0AU << ADC_SMPR2_SAMCTL9_Pos)        ///< 39_5    cycle
#define ADC_SMPR2_SAMCTL9_59_5          (0x0BU << ADC_SMPR2_SAMCTL9_Pos)        ///< 59_5    cycle
#define ADC_SMPR2_SAMCTL9_79_5          (0x0CU << ADC_SMPR2_SAMCTL9_Pos)        ///< 79_5    cycle
#define ADC_SMPR2_SAMCTL9_119_5         (0x0DU << ADC_SMPR2_SAMCTL9_Pos)        ///< 119_5   cycle
#define ADC_SMPR2_SAMCTL9_159_5         (0x0EU << ADC_SMPR2_SAMCTL9_Pos)        ///< 159_5   cycle
#define ADC_SMPR2_SAMCTL9_240_5         (0x0FU << ADC_SMPR2_SAMCTL9_Pos)        ///< 240_5   cycle
#define ADC_SMPR2_SAMCTL10_Pos          (8)                                     ///< select the sample time of corresponding channel off_set Position
#define ADC_SMPR2_SAMCTL10_Msk          (0x0FU << ADC_SMPR2_SAMCTL10_Pos)       ///< select the sample time of corresponding channel mask for Value
#define ADC_SMPR2_SAMCTL10_3_5          (0x00U << ADC_SMPR2_SAMCTL10_Pos)       ///< 3_5     cycle
#define ADC_SMPR2_SAMCTL10_4_5          (0x01U << ADC_SMPR2_SAMCTL10_Pos)       ///< 4_5     cycle
#define ADC_SMPR2_SAMCTL10_5_5          (0x02U << ADC_SMPR2_SAMCTL10_Pos)       ///< 5_5     cycle
#define ADC_SMPR2_SAMCTL10_6_5          (0x03U << ADC_SMPR2_SAMCTL10_Pos)       ///< 6_5     cycle
#define ADC_SMPR2_SAMCTL10_7_5          (0x04U << ADC_SMPR2_SAMCTL10_Pos)       ///< 7_5     cycle
#define ADC_SMPR2_SAMCTL10_11_5         (0x05U << ADC_SMPR2_SAMCTL10_Pos)       ///< 11_5    cycle
#define ADC_SMPR2_SAMCTL10_13_5         (0x06U << ADC_SMPR2_SAMCTL10_Pos)       ///< 13_5    cycle
#define ADC_SMPR2_SAMCTL10_15_5         (0x07U << ADC_SMPR2_SAMCTL10_Pos)       ///< 15_5    cycle
#define ADC_SMPR2_SAMCTL10_19_5         (0x08U << ADC_SMPR2_SAMCTL10_Pos)       ///< 19_5    cycle
#define ADC_SMPR2_SAMCTL10_29_5         (0x09U << ADC_SMPR2_SAMCTL10_Pos)       ///< 29_5    cycle
#define ADC_SMPR2_SAMCTL10_39_5         (0x0AU << ADC_SMPR2_SAMCTL10_Pos)       ///< 39_5    cycle
#define ADC_SMPR2_SAMCTL10_59_5         (0x0BU << ADC_SMPR2_SAMCTL10_Pos)       ///< 59_5    cycle
#define ADC_SMPR2_SAMCTL10_79_5         (0x0CU << ADC_SMPR2_SAMCTL10_Pos)       ///< 79_5    cycle
#define ADC_SMPR2_SAMCTL10_119_5        (0x0DU << ADC_SMPR2_SAMCTL10_Pos)       ///< 119_5   cycle
#define ADC_SMPR2_SAMCTL10_159_5        (0x0EU << ADC_SMPR2_SAMCTL10_Pos)       ///< 159_5   cycle
#define ADC_SMPR2_SAMCTL10_240_5        (0x0FU << ADC_SMPR2_SAMCTL10_Pos)       ///< 240_5   cycle
#define ADC_SMPR2_SAMCTL11_Pos          (12)                                    ///< select the sample time of corresponding channel off_set Position
#define ADC_SMPR2_SAMCTL11_Msk          (0x0FU << ADC_SMPR2_SAMCTL11_Pos)       ///< select the sample time of corresponding channel mask for Value
#define ADC_SMPR2_SAMCTL11_3_5          (0x00U << ADC_SMPR2_SAMCTL11_Pos)       ///< 3_5     cycle
#define ADC_SMPR2_SAMCTL11_4_5          (0x01U << ADC_SMPR2_SAMCTL11_Pos)       ///< 4_5     cycle
#define ADC_SMPR2_SAMCTL11_5_5          (0x02U << ADC_SMPR2_SAMCTL11_Pos)       ///< 5_5     cycle
#define ADC_SMPR2_SAMCTL11_6_5          (0x03U << ADC_SMPR2_SAMCTL11_Pos)       ///< 6_5     cycle
#define ADC_SMPR2_SAMCTL11_7_5          (0x04U << ADC_SMPR2_SAMCTL11_Pos)       ///< 7_5     cycle
#define ADC_SMPR2_SAMCTL11_11_5         (0x05U << ADC_SMPR2_SAMCTL11_Pos)       ///< 11_5    cycle
#define ADC_SMPR2_SAMCTL11_13_5         (0x06U << ADC_SMPR2_SAMCTL11_Pos)       ///< 13_5    cycle
#define ADC_SMPR2_SAMCTL11_15_5         (0x07U << ADC_SMPR2_SAMCTL11_Pos)       ///< 15_5    cycle
#define ADC_SMPR2_SAMCTL11_19_5         (0x08U << ADC_SMPR2_SAMCTL11_Pos)       ///< 19_5    cycle
#define ADC_SMPR2_SAMCTL11_29_5         (0x09U << ADC_SMPR2_SAMCTL11_Pos)       ///< 29_5    cycle
#define ADC_SMPR2_SAMCTL11_39_5         (0x0AU << ADC_SMPR2_SAMCTL11_Pos)       ///< 39_5    cycle
#define ADC_SMPR2_SAMCTL11_59_5         (0x0BU << ADC_SMPR2_SAMCTL11_Pos)       ///< 59_5    cycle
#define ADC_SMPR2_SAMCTL11_79_5         (0x0CU << ADC_SMPR2_SAMCTL11_Pos)       ///< 79_5    cycle
#define ADC_SMPR2_SAMCTL11_119_5        (0x0DU << ADC_SMPR2_SAMCTL11_Pos)       ///< 119_5   cycle
#define ADC_SMPR2_SAMCTL11_159_5        (0x0EU << ADC_SMPR2_SAMCTL11_Pos)       ///< 159_5   cycle
#define ADC_SMPR2_SAMCTL11_240_5        (0x0FU << ADC_SMPR2_SAMCTL11_Pos)       ///< 240_5   cycle
#define ADC_SMPR2_SAMCTL12_Pos          (16)                                    ///< select the sample time of corresponding channel off_set Position
#define ADC_SMPR2_SAMCTL12_Msk          (0x0FU << ADC_SMPR2_SAMCTL12_Pos)       ///< select the sample time of corresponding channel mask for Value
#define ADC_SMPR2_SAMCTL12_3_5          (0x00U << ADC_SMPR2_SAMCTL12_Pos)       ///< 3_5     cycle
#define ADC_SMPR2_SAMCTL12_4_5          (0x01U << ADC_SMPR2_SAMCTL12_Pos)       ///< 4_5     cycle
#define ADC_SMPR2_SAMCTL12_5_5          (0x02U << ADC_SMPR2_SAMCTL12_Pos)       ///< 5_5     cycle
#define ADC_SMPR2_SAMCTL12_6_5          (0x03U << ADC_SMPR2_SAMCTL12_Pos)       ///< 6_5     cycle
#define ADC_SMPR2_SAMCTL12_7_5          (0x04U << ADC_SMPR2_SAMCTL12_Pos)       ///< 7_5     cycle
#define ADC_SMPR2_SAMCTL12_11_5         (0x05U << ADC_SMPR2_SAMCTL12_Pos)       ///< 11_5    cycle
#define ADC_SMPR2_SAMCTL12_13_5         (0x06U << ADC_SMPR2_SAMCTL12_Pos)       ///< 13_5    cycle
#define ADC_SMPR2_SAMCTL12_15_5         (0x07U << ADC_SMPR2_SAMCTL12_Pos)       ///< 15_5    cycle
#define ADC_SMPR2_SAMCTL12_19_5         (0x08U << ADC_SMPR2_SAMCTL12_Pos)       ///< 19_5    cycle
#define ADC_SMPR2_SAMCTL12_29_5         (0x09U << ADC_SMPR2_SAMCTL12_Pos)       ///< 29_5    cycle
#define ADC_SMPR2_SAMCTL12_39_5         (0x0AU << ADC_SMPR2_SAMCTL12_Pos)       ///< 39_5    cycle
#define ADC_SMPR2_SAMCTL12_59_5         (0x0BU << ADC_SMPR2_SAMCTL12_Pos)       ///< 59_5    cycle
#define ADC_SMPR2_SAMCTL12_79_5         (0x0CU << ADC_SMPR2_SAMCTL12_Pos)       ///< 79_5    cycle
#define ADC_SMPR2_SAMCTL12_119_5        (0x0DU << ADC_SMPR2_SAMCTL12_Pos)       ///< 119_5   cycle
#define ADC_SMPR2_SAMCTL12_159_5        (0x0EU << ADC_SMPR2_SAMCTL12_Pos)       ///< 159_5   cycle
#define ADC_SMPR2_SAMCTL12_240_5        (0x0FU << ADC_SMPR2_SAMCTL12_Pos)       ///< 240_5   cycle
#define ADC_SMPR2_SAMCTL13_Pos          (20)                                    ///< select the sample time of corresponding channel off_set Position
#define ADC_SMPR2_SAMCTL13_Msk          (0x0FU << ADC_SMPR2_SAMCTL13_Pos)       ///< select the sample time of corresponding channel mask for Value
#define ADC_SMPR2_SAMCTL13_3_5          (0x00U << ADC_SMPR2_SAMCTL13_Pos)       ///< 3_5     cycle
#define ADC_SMPR2_SAMCTL13_4_5          (0x01U << ADC_SMPR2_SAMCTL13_Pos)       ///< 4_5     cycle
#define ADC_SMPR2_SAMCTL13_5_5          (0x02U << ADC_SMPR2_SAMCTL13_Pos)       ///< 5_5     cycle
#define ADC_SMPR2_SAMCTL13_6_5          (0x03U << ADC_SMPR2_SAMCTL13_Pos)       ///< 6_5     cycle
#define ADC_SMPR2_SAMCTL13_7_5          (0x04U << ADC_SMPR2_SAMCTL13_Pos)       ///< 7_5     cycle
#define ADC_SMPR2_SAMCTL13_11_5         (0x05U << ADC_SMPR2_SAMCTL13_Pos)       ///< 11_5    cycle
#define ADC_SMPR2_SAMCTL13_13_5         (0x06U << ADC_SMPR2_SAMCTL13_Pos)       ///< 13_5    cycle
#define ADC_SMPR2_SAMCTL13_15_5         (0x07U << ADC_SMPR2_SAMCTL13_Pos)       ///< 15_5    cycle
#define ADC_SMPR2_SAMCTL13_19_5         (0x08U << ADC_SMPR2_SAMCTL13_Pos)       ///< 19_5    cycle
#define ADC_SMPR2_SAMCTL13_29_5         (0x09U << ADC_SMPR2_SAMCTL13_Pos)       ///< 29_5    cycle
#define ADC_SMPR2_SAMCTL13_39_5         (0x0AU << ADC_SMPR2_SAMCTL13_Pos)       ///< 39_5    cycle
#define ADC_SMPR2_SAMCTL13_59_5         (0x0BU << ADC_SMPR2_SAMCTL13_Pos)       ///< 59_5    cycle
#define ADC_SMPR2_SAMCTL13_79_5         (0x0CU << ADC_SMPR2_SAMCTL13_Pos)       ///< 79_5    cycle
#define ADC_SMPR2_SAMCTL13_119_5        (0x0DU << ADC_SMPR2_SAMCTL13_Pos)       ///< 119_5   cycle
#define ADC_SMPR2_SAMCTL13_159_5        (0x0EU << ADC_SMPR2_SAMCTL13_Pos)       ///< 159_5   cycle
#define ADC_SMPR2_SAMCTL13_240_5        (0x0FU << ADC_SMPR2_SAMCTL13_Pos)       ///< 240_5   cycle
#define ADC_SMPR2_SAMCTL14_Pos          (24)                                    ///< select the sample time of corresponding channel off_set Position
#define ADC_SMPR2_SAMCTL14_Msk          (0x0FU << ADC_SMPR2_SAMCTL14_Pos)       ///< select the sample time of corresponding channel mask for Value
#define ADC_SMPR2_SAMCTL14_3_5          (0x00U << ADC_SMPR2_SAMCTL14_Pos)       ///< 3_5     cycle
#define ADC_SMPR2_SAMCTL14_4_5          (0x01U << ADC_SMPR2_SAMCTL14_Pos)       ///< 4_5     cycle
#define ADC_SMPR2_SAMCTL14_5_5          (0x02U << ADC_SMPR2_SAMCTL14_Pos)       ///< 5_5     cycle
#define ADC_SMPR2_SAMCTL14_6_5          (0x03U << ADC_SMPR2_SAMCTL14_Pos)       ///< 6_5     cycle
#define ADC_SMPR2_SAMCTL14_7_5          (0x04U << ADC_SMPR2_SAMCTL14_Pos)       ///< 7_5     cycle
#define ADC_SMPR2_SAMCTL14_11_5         (0x05U << ADC_SMPR2_SAMCTL14_Pos)       ///< 11_5    cycle
#define ADC_SMPR2_SAMCTL14_13_5         (0x06U << ADC_SMPR2_SAMCTL14_Pos)       ///< 13_5    cycle
#define ADC_SMPR2_SAMCTL14_15_5         (0x07U << ADC_SMPR2_SAMCTL14_Pos)       ///< 15_5    cycle
#define ADC_SMPR2_SAMCTL14_19_5         (0x08U << ADC_SMPR2_SAMCTL14_Pos)       ///< 19_5    cycle
#define ADC_SMPR2_SAMCTL14_29_5         (0x09U << ADC_SMPR2_SAMCTL14_Pos)       ///< 29_5    cycle
#define ADC_SMPR2_SAMCTL14_39_5         (0x0AU << ADC_SMPR2_SAMCTL14_Pos)       ///< 39_5    cycle
#define ADC_SMPR2_SAMCTL14_59_5         (0x0BU << ADC_SMPR2_SAMCTL14_Pos)       ///< 59_5    cycle
#define ADC_SMPR2_SAMCTL14_79_5         (0x0CU << ADC_SMPR2_SAMCTL14_Pos)       ///< 79_5    cycle
#define ADC_SMPR2_SAMCTL14_119_5        (0x0DU << ADC_SMPR2_SAMCTL14_Pos)       ///< 119_5   cycle
#define ADC_SMPR2_SAMCTL14_159_5        (0x0EU << ADC_SMPR2_SAMCTL14_Pos)       ///< 159_5   cycle
#define ADC_SMPR2_SAMCTL14_240_5        (0x0FU << ADC_SMPR2_SAMCTL14_Pos)       ///< 240_5   cycle
#define ADC_SMPR2_SAMCTL15_Pos          (28)                                    ///< select the sample time of corresponding channel off_set Position
#define ADC_SMPR2_SAMCTL15_Msk          (0x0FU << ADC_SMPR2_SAMCTL15_Pos)       ///< select the sample time of corresponding channel mask for Value
#define ADC_SMPR2_SAMCTL15_3_5          (0x00U << ADC_SMPR2_SAMCTL15_Pos)       ///< 3_5     cycle
#define ADC_SMPR2_SAMCTL15_4_5          (0x01U << ADC_SMPR2_SAMCTL15_Pos)       ///< 4_5     cycle
#define ADC_SMPR2_SAMCTL15_5_5          (0x02U << ADC_SMPR2_SAMCTL15_Pos)       ///< 5_5     cycle
#define ADC_SMPR2_SAMCTL15_6_5          (0x03U << ADC_SMPR2_SAMCTL15_Pos)       ///< 6_5     cycle
#define ADC_SMPR2_SAMCTL15_7_5          (0x04U << ADC_SMPR2_SAMCTL15_Pos)       ///< 7_5     cycle
#define ADC_SMPR2_SAMCTL15_11_5         (0x05U << ADC_SMPR2_SAMCTL15_Pos)       ///< 11_5    cycle
#define ADC_SMPR2_SAMCTL15_13_5         (0x06U << ADC_SMPR2_SAMCTL15_Pos)       ///< 13_5    cycle
#define ADC_SMPR2_SAMCTL15_15_5         (0x07U << ADC_SMPR2_SAMCTL15_Pos)       ///< 15_5    cycle
#define ADC_SMPR2_SAMCTL15_19_5         (0x08U << ADC_SMPR2_SAMCTL15_Pos)       ///< 19_5    cycle
#define ADC_SMPR2_SAMCTL15_29_5         (0x09U << ADC_SMPR2_SAMCTL15_Pos)       ///< 29_5    cycle
#define ADC_SMPR2_SAMCTL15_39_5         (0x0AU << ADC_SMPR2_SAMCTL15_Pos)       ///< 39_5    cycle
#define ADC_SMPR2_SAMCTL15_59_5         (0x0BU << ADC_SMPR2_SAMCTL15_Pos)       ///< 59_5    cycle
#define ADC_SMPR2_SAMCTL15_79_5         (0x0CU << ADC_SMPR2_SAMCTL15_Pos)       ///< 79_5    cycle
#define ADC_SMPR2_SAMCTL15_119_5        (0x0DU << ADC_SMPR2_SAMCTL15_Pos)       ///< 119_5   cycle
#define ADC_SMPR2_SAMCTL15_159_5        (0x0EU << ADC_SMPR2_SAMCTL15_Pos)       ///< 159_5   cycle
#define ADC_SMPR2_SAMCTL15_240_5        (0x0FU << ADC_SMPR2_SAMCTL15_Pos)       ///< 240_5   cycle
////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_JOFR0 mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_JOFR0_JOFR                  (0xFFFU)                                ///< Compensates for the A/D conversion results of the injected channel 0
////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_JOFR1 mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_JOFR1_JOFR                  (0xFFFU)                                ///< Compensates for the A/D conversion results of the injected channel 1
////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_JOFR2 mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_JOFR2_JOFR                  (0xFFFU)                                ///< Compensates for the A/D conversion results of the injected channel 2
////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_JOFR3 mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_JOFR3_JOFR                  (0xFFFU)                                ///< Compensates for the A/D conversion results of the injected channel 3
////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_JSQR mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_JSQR_JSQ0_Pos               (0)                                     ///< 1st conversion in injected sequence
#define ADC_JSQR_JSQ0                   (0x1FU << ADC_JSQR_JSQ0_Pos)            ///< 0th Conversion for Injected Sequence
#define ADC_JSQR_JSQ0_CH0               (0x00U << ADC_JSQR_JSQ0_Pos)            ///< Configure any channel 0 as injection channel 0
#define ADC_JSQR_JSQ0_CH1               (0x01U << ADC_JSQR_JSQ0_Pos)            ///< Configure any channel 1 as injection channel 0
#define ADC_JSQR_JSQ0_CH2               (0x02U << ADC_JSQR_JSQ0_Pos)            ///< Configure any channel 2 as injection channel 0
#define ADC_JSQR_JSQ0_CH3               (0x03U << ADC_JSQR_JSQ0_Pos)            ///< Configure any channel 3 as injection channel 0
#define ADC_JSQR_JSQ0_CH4               (0x04U << ADC_JSQR_JSQ0_Pos)            ///< Configure any channel 4 as injection channel 0
#define ADC_JSQR_JSQ0_CH5               (0x05U << ADC_JSQR_JSQ0_Pos)            ///< Configure any channel 5 as injection channel 0
#define ADC_JSQR_JSQ0_CH6               (0x06U << ADC_JSQR_JSQ0_Pos)            ///< Configure any channel 6 as injection channel 0
#define ADC_JSQR_JSQ0_CH7               (0x07U << ADC_JSQR_JSQ0_Pos)            ///< Configure any channel 7 as injection channel 0
#define ADC_JSQR_JSQ0_CH8               (0x08U << ADC_JSQR_JSQ0_Pos)            ///< Configure any channel 8 as injection channel 0
#define ADC_JSQR_JSQ0_CH9               (0x09U << ADC_JSQR_JSQ0_Pos)            ///< Configure any channel 9 as injection channel 0
#define ADC_JSQR_JSQ0_CH10              (0x0AU << ADC_JSQR_JSQ0_Pos)            ///< Configure any channel 10 as injection channel 0
#define ADC_JSQR_JSQ0_CH11              (0x0BU << ADC_JSQR_JSQ0_Pos)            ///< Configure any channel 11 as injection channel 0
#define ADC_JSQR_JSQ0_CH12              (0x0CU << ADC_JSQR_JSQ0_Pos)            ///< Configure any channel 12 as injection channel 0
#define ADC_JSQR_JSQ0_CH13              (0x0DU << ADC_JSQR_JSQ0_Pos)            ///< Configure any channel 13 as injection channel 0
#define ADC_JSQR_JSQ0_CH14              (0x0EU << ADC_JSQR_JSQ0_Pos)            ///< Configure any channel 14 as injection channel 0
#define ADC_JSQR_JSQ0_CH15              (0x0FU << ADC_JSQR_JSQ0_Pos)            ///< Configure any channel 15 as injection channel 0
#define ADC_JSQR_JSQ0_0                 (0x01U << ADC_JSQR_JSQ0_Pos)            ///< Bit 0
#define ADC_JSQR_JSQ0_1                 (0x02U << ADC_JSQR_JSQ0_Pos)            ///< Bit 1
#define ADC_JSQR_JSQ0_2                 (0x04U << ADC_JSQR_JSQ0_Pos)            ///< Bit 2
#define ADC_JSQR_JSQ0_3                 (0x08U << ADC_JSQR_JSQ0_Pos)            ///< Bit 3
#define ADC_JSQR_JSQ0_4                 (0x10U << ADC_JSQR_JSQ0_Pos)            ///< Bit 4
#define ADC_JSQR_JSQ1_Pos               (5)                                     ///< 2st conversion in injected sequence
#define ADC_JSQR_JSQ1                   (0x1FU << ADC_JSQR_JSQ1_Pos)            ///< 1th Conversion for Injected Sequence
#define ADC_JSQR_JSQ1_CH0               (0x00U << ADC_JSQR_JSQ1_Pos)            ///< Configure any channel 0 as injection channel 1
#define ADC_JSQR_JSQ1_CH1               (0x01U << ADC_JSQR_JSQ1_Pos)            ///< Configure any channel 1 as injection channel 1
#define ADC_JSQR_JSQ1_CH2               (0x02U << ADC_JSQR_JSQ1_Pos)            ///< Configure any channel 2 as injection channel 1
#define ADC_JSQR_JSQ1_CH3               (0x03U << ADC_JSQR_JSQ1_Pos)            ///< Configure any channel 3 as injection channel 1
#define ADC_JSQR_JSQ1_CH4               (0x04U << ADC_JSQR_JSQ1_Pos)            ///< Configure any channel 4 as injection channel 1
#define ADC_JSQR_JSQ1_CH5               (0x05U << ADC_JSQR_JSQ1_Pos)            ///< Configure any channel 5 as injection channel 1
#define ADC_JSQR_JSQ1_CH6               (0x06U << ADC_JSQR_JSQ1_Pos)            ///< Configure any channel 6 as injection channel 1
#define ADC_JSQR_JSQ1_CH7               (0x07U << ADC_JSQR_JSQ1_Pos)            ///< Configure any channel 7 as injection channel 1
#define ADC_JSQR_JSQ1_CH8               (0x08U << ADC_JSQR_JSQ1_Pos)            ///< Configure any channel 8 as injection channel 1
#define ADC_JSQR_JSQ1_CH9               (0x09U << ADC_JSQR_JSQ1_Pos)            ///< Configure any channel 9 as injection channel 1
#define ADC_JSQR_JSQ1_CH10              (0x0AU << ADC_JSQR_JSQ1_Pos)            ///< Configure any channel 10 as injection channel 1
#define ADC_JSQR_JSQ1_CH11              (0x0BU << ADC_JSQR_JSQ1_Pos)            ///< Configure any channel 11 as injection channel 1
#define ADC_JSQR_JSQ1_CH12              (0x0CU << ADC_JSQR_JSQ1_Pos)            ///< Configure any channel 12 as injection channel 1
#define ADC_JSQR_JSQ1_CH13              (0x0DU << ADC_JSQR_JSQ1_Pos)            ///< Configure any channel 13 as injection channel 1
#define ADC_JSQR_JSQ1_CH14              (0x0EU << ADC_JSQR_JSQ1_Pos)            ///< Configure any channel 14 as injection channel 1
#define ADC_JSQR_JSQ1_CH15              (0x0FU << ADC_JSQR_JSQ1_Pos)            ///< Configure any channel 15 as injection channel 1
#define ADC_JSQR_JSQ1_0                 (0x01U << ADC_JSQR_JSQ1_Pos)            ///< Bit 0
#define ADC_JSQR_JSQ1_1                 (0x02U << ADC_JSQR_JSQ1_Pos)            ///< Bit 1
#define ADC_JSQR_JSQ1_2                 (0x04U << ADC_JSQR_JSQ1_Pos)            ///< Bit 2
#define ADC_JSQR_JSQ1_3                 (0x08U << ADC_JSQR_JSQ1_Pos)            ///< Bit 3
#define ADC_JSQR_JSQ1_4                 (0x10U << ADC_JSQR_JSQ1_Pos)            ///< Bit 4
#define ADC_JSQR_JSQ2_Pos               (10)                                    ///< 3st conversion in injected sequence
#define ADC_JSQR_JSQ2                   (0x1FU << ADC_JSQR_JSQ2_Pos)            ///< 2th Conversion for Injected Sequence
#define ADC_JSQR_JSQ2_CH0               (0x00U << ADC_JSQR_JSQ2_Pos)            ///< Configure any channel 0 as injection channel 2
#define ADC_JSQR_JSQ2_CH1               (0x01U << ADC_JSQR_JSQ2_Pos)            ///< Configure any channel 1 as injection channel 2
#define ADC_JSQR_JSQ2_CH2               (0x02U << ADC_JSQR_JSQ2_Pos)            ///< Configure any channel 2 as injection channel 2
#define ADC_JSQR_JSQ2_CH3               (0x03U << ADC_JSQR_JSQ2_Pos)            ///< Configure any channel 3 as injection channel 2
#define ADC_JSQR_JSQ2_CH4               (0x04U << ADC_JSQR_JSQ2_Pos)            ///< Configure any channel 4 as injection channel 2
#define ADC_JSQR_JSQ2_CH5               (0x05U << ADC_JSQR_JSQ2_Pos)            ///< Configure any channel 5 as injection channel 2
#define ADC_JSQR_JSQ2_CH6               (0x06U << ADC_JSQR_JSQ2_Pos)            ///< Configure any channel 6 as injection channel 2
#define ADC_JSQR_JSQ2_CH7               (0x07U << ADC_JSQR_JSQ2_Pos)            ///< Configure any channel 7 as injection channel 2
