SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32SPIN0280/MM32SPIN0280_Bootloader/Device/MM32SPIN0280/Include/reg_adc.h
#define ADC_JSQR_JSQ2_CH8               (0x08U << ADC_JSQR_JSQ2_Pos)            ///< Configure any channel 8 as injection channel 2
#define ADC_JSQR_JSQ2_CH9               (0x09U << ADC_JSQR_JSQ2_Pos)            ///< Configure any channel 9 as injection channel 2
#define ADC_JSQR_JSQ2_CH10              (0x0AU << ADC_JSQR_JSQ2_Pos)            ///< Configure any channel 10 as injection channel 2
#define ADC_JSQR_JSQ2_CH11              (0x0BU << ADC_JSQR_JSQ2_Pos)            ///< Configure any channel 11 as injection channel 2
#define ADC_JSQR_JSQ2_CH12              (0x0CU << ADC_JSQR_JSQ2_Pos)            ///< Configure any channel 12 as injection channel 2
#define ADC_JSQR_JSQ2_CH13              (0x0DU << ADC_JSQR_JSQ2_Pos)            ///< Configure any channel 13 as injection channel 2
#define ADC_JSQR_JSQ2_CH14              (0x0EU << ADC_JSQR_JSQ2_Pos)            ///< Configure any channel 14 as injection channel 2
#define ADC_JSQR_JSQ2_CH15              (0x0FU << ADC_JSQR_JSQ2_Pos)            ///< Configure any channel 15 as injection channel 2
#define ADC_JSQR_JSQ2_0                 (0x01U << ADC_JSQR_JSQ2_Pos)            ///< Bit 0
#define ADC_JSQR_JSQ2_1                 (0x02U << ADC_JSQR_JSQ2_Pos)            ///< Bit 1
#define ADC_JSQR_JSQ2_2                 (0x04U << ADC_JSQR_JSQ2_Pos)            ///< Bit 2
#define ADC_JSQR_JSQ2_3                 (0x08U << ADC_JSQR_JSQ2_Pos)            ///< Bit 3
#define ADC_JSQR_JSQ2_4                 (0x10U << ADC_JSQR_JSQ2_Pos)            ///< Bit 4
#define ADC_JSQR_JSQ3_Pos               (15)                                    ///< 4st conversion in injected sequence
#define ADC_JSQR_JSQ3                   (0x1FU << ADC_JSQR_JSQ3_Pos)            ///< 3th Conversion for Injected Sequence
#define ADC_JSQR_JSQ3_CH0               (0x00U << ADC_JSQR_JSQ3_Pos)            ///< Configure any channel 0 as injection channel 3
#define ADC_JSQR_JSQ3_CH1               (0x01U << ADC_JSQR_JSQ3_Pos)            ///< Configure any channel 1 as injection channel 3
#define ADC_JSQR_JSQ3_CH2               (0x02U << ADC_JSQR_JSQ3_Pos)            ///< Configure any channel 2 as injection channel 3
#define ADC_JSQR_JSQ3_CH3               (0x03U << ADC_JSQR_JSQ3_Pos)            ///< Configure any channel 3 as injection channel 3
#define ADC_JSQR_JSQ3_CH4               (0x04U << ADC_JSQR_JSQ3_Pos)            ///< Configure any channel 4 as injection channel 3
#define ADC_JSQR_JSQ3_CH5               (0x05U << ADC_JSQR_JSQ3_Pos)            ///< Configure any channel 5 as injection channel 3
#define ADC_JSQR_JSQ3_CH6               (0x06U << ADC_JSQR_JSQ3_Pos)            ///< Configure any channel 6 as injection channel 3
#define ADC_JSQR_JSQ3_CH7               (0x07U << ADC_JSQR_JSQ3_Pos)            ///< Configure any channel 7 as injection channel 3
#define ADC_JSQR_JSQ3_CH8               (0x08U << ADC_JSQR_JSQ3_Pos)            ///< Configure any channel 8 as injection channel 3
#define ADC_JSQR_JSQ3_CH9               (0x09U << ADC_JSQR_JSQ3_Pos)            ///< Configure any channel 9 as injection channel 3
#define ADC_JSQR_JSQ3_CH10              (0x0AU << ADC_JSQR_JSQ3_Pos)            ///< Configure any channel 10 as injection channel 3
#define ADC_JSQR_JSQ3_CH11              (0x0BU << ADC_JSQR_JSQ3_Pos)            ///< Configure any channel 11 as injection channel 3
#define ADC_JSQR_JSQ3_CH12              (0x0CU << ADC_JSQR_JSQ3_Pos)            ///< Configure any channel 12 as injection channel 3
#define ADC_JSQR_JSQ3_CH13              (0x0DU << ADC_JSQR_JSQ3_Pos)            ///< Configure any channel 13 as injection channel 3
#define ADC_JSQR_JSQ3_CH14              (0x0EU << ADC_JSQR_JSQ3_Pos)            ///< Configure any channel 14 as injection channel 3
#define ADC_JSQR_JSQ3_CH15              (0x0FU << ADC_JSQR_JSQ3_Pos)            ///< Configure any channel 15 as injection channel 3
#define ADC_JSQR_JSQ3_0                 (0x01U << ADC_JSQR_JSQ3_Pos)            ///< Bit 0
#define ADC_JSQR_JSQ3_1                 (0x02U << ADC_JSQR_JSQ3_Pos)            ///< Bit 1
#define ADC_JSQR_JSQ3_2                 (0x04U << ADC_JSQR_JSQ3_Pos)            ///< Bit 2
#define ADC_JSQR_JSQ3_3                 (0x08U << ADC_JSQR_JSQ3_Pos)            ///< Bit 3
#define ADC_JSQR_JSQ3_4                 (0x10U << ADC_JSQR_JSQ3_Pos)            ///< Bit 4

#define ADC_JSQR_JNUM_Pos               (20)
#define ADC_JSQR_JNUM                   (0x03U << ADC_JSQR_JNUM_Pos)            ///< Channel Number for Injected Sequence mask
#define ADC_JSQR_JNUM_MODE0             (0x00U << ADC_JSQR_JNUM_Pos)            ///< JSQ0 channel only
#define ADC_JSQR_JNUM_MODE1             (0x01U << ADC_JSQR_JNUM_Pos)            ///< JSQ0~JSQ1 channels
#define ADC_JSQR_JNUM_MODE2             (0x02U << ADC_JSQR_JNUM_Pos)            ///< JSQ0~JSQ2 channels
#define ADC_JSQR_JNUM_MODE3             (0x03U << ADC_JSQR_JNUM_Pos)            ///< JSQ0~JSQ3 channels

#define ADC_JSQR_JNUM_0                 (0x01U << ADC_JSQR_JNUM_Pos)            ///< Channel Number for Injected Sequence bit 0
#define ADC_JSQR_JNUM_1                 (0x02U << ADC_JSQR_JNUM_Pos)            ///< Channel Number for Injected Sequence bit 1
#define ADC_JSQR_JNUM_JSQ0              ADC_JSQR_JNUM_MODE0
#define ADC_JSQR_JNUM_JSQ0_JSQ1         ADC_JSQR_JNUM_MODE1
#define ADC_JSQR_JNUM_JSQ0_JSQ2         ADC_JSQR_JNUM_MODE2
#define ADC_JSQR_JNUM_JSQ0_JSQ3         ADC_JSQR_JNUM_MODE3
#define ADC_JSQR_JL_Pos                 ADC_JSQR_JNUM_Pos
#define ADC_JSQR_JL                     ADC_JSQR_JNUM
#define ADC_JSQR_JL_0                   ADC_JSQR_JNUM_0
#define ADC_JSQR_JL_1                   ADC_JSQR_JNUM_1

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_JDATA mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_JDATA_JDATA_Pos             (0)
#define ADC_JDATA_JDATA                 (0xFFFFU << ADC_JDATA_JDATA_Pos)        ///< Transfer data
#define ADC_JDATA_JCHANNELSEL_Pos       (16)
#define ADC_JDATA_JCHANNELSEL           (0x1FU << ADC_JDATA_JCHANNELSEL_Pos)    ///< Channel selection
#define ADC_JDATA_JCHANNELSEL_CHAN0     (0x00U << ADC_JDATA_JCHANNELSEL_Pos)    ///< conversion data of channel 0
#define ADC_JDATA_JCHANNELSEL_CHAN1     (0x01U << ADC_JDATA_JCHANNELSEL_Pos)    ///< conversion data of channel 1
#define ADC_JDATA_JCHANNELSEL_CHAN2     (0x02U << ADC_JDATA_JCHANNELSEL_Pos)    ///< conversion data of channel 2
#define ADC_JDATA_JCHANNELSEL_CHAN3     (0x03U << ADC_JDATA_JCHANNELSEL_Pos)    ///< conversion data of channel 3
#define ADC_JDATA_JCHANNELSEL_CHAN4     (0x04U << ADC_JDATA_JCHANNELSEL_Pos)    ///< conversion data of channel 4
#define ADC_JDATA_JCHANNELSEL_CHAN5     (0x05U << ADC_JDATA_JCHANNELSEL_Pos)    ///< conversion data of channel 5
#define ADC_JDATA_JCHANNELSEL_CHAN6     (0x06U << ADC_JDATA_JCHANNELSEL_Pos)    ///< conversion data of channel 6
#define ADC_JDATA_JCHANNELSEL_CHAN7     (0x07U << ADC_JDATA_JCHANNELSEL_Pos)    ///< conversion data of channel 7
#define ADC_JDATA_JCHANNELSEL_CHAN8     (0x08U << ADC_JDATA_JCHANNELSEL_Pos)    ///< conversion data of channel 8
#define ADC_JDATA_JCHANNELSEL_CHAN9     (0x09U << ADC_JDATA_JCHANNELSEL_Pos)    ///< conversion data of channel 9
#define ADC_JDATA_JCHANNELSEL_CHAN10    (0x0AU << ADC_JDATA_JCHANNELSEL_Pos)    ///< conversion data of channel 10
#define ADC_JDATA_JCHANNELSEL_CHAN11    (0x0BU << ADC_JDATA_JCHANNELSEL_Pos)    ///< conversion data of channel 11
#define ADC_JDATA_JCHANNELSEL_CHAN12    (0x0CU << ADC_JDATA_JCHANNELSEL_Pos)    ///< conversion data of channel 12
#define ADC_JDATA_JCHANNELSEL_CHAN13    (0x0DU << ADC_JDATA_JCHANNELSEL_Pos)    ///< conversion data of channel 13
#define ADC_JDATA_JCHANNELSEL_CHAN14    (0x0EU << ADC_JDATA_JCHANNELSEL_Pos)    ///< conversion data of channel 14
#define ADC_JDATA_JCHANNELSEL_CHAN15    (0x0FU << ADC_JDATA_JCHANNELSEL_Pos)    ///< conversion data of channel 15
#define ADC_JDATA_JOVERRUN_Pos          (21)
#define ADC_JDATA_JOVERRUN              (0x01U << ADC_JDATA_JOVERRUN_Pos)       ///< Overrun flag
#define ADC_JDATA_JVALID_Pos            (22)
#define ADC_JDATA_JVALID                (0x01U << ADC_JDATA_JVALID_Pos)         ///< Valid flag

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CORRS mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_CORRS_GAINCORR_Pos          (0)
#define ADC_CORRS_GAINCORR              (0xFFFU << ADC_CORRS_GAINCORR_Pos)      ///< 12-bit gain correction parameter
#define ADC_CORRS_OFFSETCORR_Pos        (16)
#define ADC_CORRS_OFFSETCORR            (0xFFFU << ADC_CORRS_OFFSETCORR_Pos)    ///< 12-bit offset correction parameter

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CORRD mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_CORRD_GAINCORR_Pos          (0)
#define ADC_CORRD_GAINCORR              (0xFFFU << ADC_CORRD_GAINCORR_Pos)      ///< 12-bit gain correction parameter
#define ADC_CORRD_OFFSETCORR_Pos        (16)
#define ADC_CORRD_OFFSETCORR            (0xFFFU << ADC_CORRD_OFFSETCORR_Pos)    ///< 12-bit offset correction parameter

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_CORRP mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_CORRP_GAINCORR_Pos          (0)
#define ADC_CORRP_GAINCORR              (0xFFFU << ADC_CORRP_GAINCORR_Pos)      ///< 12-bit gain correction parameter
#define ADC_CORRP_OFFSETCORR_Pos        (16)
#define ADC_CORRP_OFFSETCORR            (0xFFFU << ADC_CORRP_OFFSETCORR_Pos)    ///< 12-bit offset correction parameter

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_JDR0 mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_JDR0_JDATA_Pos              (0)
#define ADC_JDR0_JDATA                  (0xFFFFU << ADC_JDR0_JDATA_Pos)         ///< Transfer data
#define ADC_JDR0_JOVERRUN_Pos           (21)
#define ADC_JDR0_JOVERRUN               (0x01U << ADC_JDR0_JOVERRUN_Pos)        ///< Overrun flag
#define ADC_JDR0_JVALID_Pos             (22)
#define ADC_JDR0_JVALID                 (0x01U << ADC_JDR0_JVALID_Pos)          ///< Valid flag

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_JDR1 mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_JDR1_JDATA_Pos              (0)
#define ADC_JDR1_JDATA                  (0xFFFFU << ADC_JDR1_JDATA_Pos)         ///< Transfer data
#define ADC_JDR1_JOVERRUN_Pos           (21)
#define ADC_JDR1_JOVERRUN               (0x01U << ADC_JDR1_JOVERRUN_Pos)        ///< Overrun flag
#define ADC_JDR1_JVALID_Pos             (22)
#define ADC_JDR1_JVALID                 (0x01U << ADC_JDR1_JVALID_Pos)          ///< Valid flag

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_JDR2 mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_JDR2_JDATA_Pos              (0)
#define ADC_JDR2_JDATA                  (0xFFFFU << ADC_JDR2_JDATA_Pos)         ///< Transfer data
#define ADC_JDR2_JOVERRUN_Pos           (21)
#define ADC_JDR2_JOVERRUN               (0x01U << ADC_JDR2_JOVERRUN_Pos)        ///< Overrun flag
#define ADC_JDR2_JVALID_Pos             (22)
#define ADC_JDR2_JVALID                 (0x01U << ADC_JDR2_JVALID_Pos)          ///< Valid flag

////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_JDR3 mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_JDR3_JDATA_Pos              (0)
#define ADC_JDR3_JDATA                  (0xFFFFU << ADC_JDR3_JDATA_Pos)         ///< Transfer data
#define ADC_JDR3_JOVERRUN_Pos           (21)
#define ADC_JDR3_JOVERRUN               (0x01U << ADC_JDR3_JOVERRUN_Pos)        ///< Overrun flag
#define ADC_JDR3_JVALID_Pos             (22)
#define ADC_JDR3_JVALID                 (0x01U << ADC_JDR3_JVALID_Pos)          ///< Valid flag

/// @}

/// @}

/// @}

#ifdef __cplusplus
}
#endif

////////////////////////////////////////////////////////////////////////////////
#endif
////////////////////////////////////////////////////////////////////////////////
